{"pages":[{"title":"Archives","text":"","link":"/archives/index.html"},{"title":"Tags","text":"","link":"/tags/index.html"},{"title":"About Xcellerate+","text":"电子邮箱：mikezhengwses@qq.com 知乎：@郑寅豪 旅法师营地：@Xcellerate 微信号： Xcellerate_zyh","link":"/about/index.html"},{"title":"Categories","text":"","link":"/categories/index.html"}],"posts":[{"title":"引言","text":"为什么要建立这个博客？ 博客从互联网问世起就经久不衰，无非是因为满足了两项功能：一是言志，通过发博自由地抒发自己的感情，或是分享宝贵的经验；二是归档，将各个时期的想法与创作镌刻在云端，而不至于让记忆在漫长时光中磨灭。 过去我使用的功能最接近博客的网站是知乎，无论是评价话题还是写文章都很方便。然而日益严苛的审核尺度以及充斥版面的无厘头提问，都使其不再能满足上述的需求。 其实独立建站的想法在去年年底就已经有了，然而查到的Wordpress方案较为昂贵，加上学业碰到了一点挫折，只好暂时搁置。幸好 Herr Zhao 在四月初发布了详细的Hexo入门教程，这才下定决心，花了几天时间把这个博客搭出来。 关于博客的名字，Xcellerate 是我高一时候给自己起的网名，一直沿用至今，大概是取Accelerate+Excellent的含义。后面的+意味着对我创作过的全体内容做一次大整合——迄今为止or从今往后，都可以在这里寻得踪迹。 总而言之，这个博客整合了之前在各个社交平台上发布的内容，以后有什么想法也会优先发在这里。想要了解更多信息可以参考“公告”分类下的 更新日志 和 阅读指南。 感谢各位的来访！","link":"/2020/04/27/embark/"},{"title":"画廊","text":"此处陈列 Xcellerate+ 使用过的徽标及插图。 LOGO Favicon About 1234以上插图的出处：-同济大学嘉定校区的“仰望星空”楼，校方提供-德国城市亚琛的火车站，本人拍摄-动画《Kill la Kill》的结局画面","link":"/2021/04/29/gallery/"},{"title":"更新日志","text":"扩展：文章中的内容将会不断更新。 2021.4.29原域名已到期，为了节约租赁费用，启用全新域名: zyh-arc.xyz 重新绘制Logo与Favicon，今后每年都会有新的主题。 2020.5.24由于七牛云测试域名到期，已为每篇文章的多媒体内容换源。 目前图片使用路过图床，音乐/视频等另行找外链。 微调了博客主题，移除了一些多余的图标。 2020.4.27添加了基于Sharejs的分享功能。 即日起 Xcellerate+ 正式进入公开发布阶段。 2020.4.26-c添加了基于Valine的评论区。 目前hexo-tag-aplayer与插入图片（html格式）冲突，部署时会报错，但暂未对网站运行造成严重影响。 2020.4.26-b更换了自定义的Logo与Favicon。 2020.4.26-a对目前的所有文章进行重新排版： 根据Icarus的样式调整格式； 图片链接一律从七牛云图床引用，已有的图片重新编号命名； 文章右侧添加目录； 添加摘要与”阅读更多“功能； 已启用微信打赏，但评论区还是不可用。 2020.4.25-b主题更换为Icarus。 目前仅对针对网站框架做了基本的修改，评论和打赏暂不可用。 待完成：重新排版每篇文章，使用图床，更换logo 2020.4.25-a启用自定义域名：x-plus.xyz 鉴于Hiero主题存在兼容性问题，考虑更换成Icarus主题。 部分从知乎转载的文章存在图片链接失效问题，后续会予以修复。 2020.4.24将本地文件转移到七牛云上，成功实现文件下载与MP3播放，顺带修复了部分知乎图片的链接。 待完成功能：美化模板、全面引用图床、自定义域名 2020.4.23-b微调主题并上传了少量post，开始内部测试。 可用功能：文本、图片、Html文本、视频播放、Aplayer音乐播放、文章评论 待完成功能：下载、引用本地文件 为了简洁，暂时屏蔽了主题自带的友情链接、标签云、打赏、访问统计。 2020.4.23-a博客搭建完成，可实现基本的访问、部署功能。 使用的主题为Hiero。 2020.4.22开始筹备建站，注册Github账号，安装Git、Nodejs与Hexo框架","link":"/2021/04/29/log/"},{"title":"炉边漫话（第二期）","text":"整合了2020年在知乎”炉石传说“话题下零散的回答. 1注：部分时间较早、前瞻性的回答已经不适用于当前的游戏环境，请谨慎参考！ 如何解答炉石传说引发的跟班概率问题？ 2020.6.1 模拟一个场景，对面需要泰坦跟班苟活，他打了个怪盗恶霸，其中一个是泰坦跟班，他苟住了。但在你的视角里，他的另一个也是泰坦跟班的概率是多少？ 奥术飞弹打精灵龙是纯粹的概率问题，事件的性质是恒定的。 跟班问题则不然，采用独立概率/条件概率完全取决于当前的游戏局势。（或者说你的主观理解） 他打了个怪盗恶霸，其中一个是泰坦跟班，他苟住了 题设条件下第二个跟班是不是泰坦已经无法影响“苟住”的结果，因此1/7（独立概率）是更有意义的数据。 反之，如果对手需要连续打两个泰坦跟班才能阻止斩杀，则更应该相信1/13（条件概率）。 举个更形象的例子吧，老王家有一个女孩，他的第二个孩子即将出生，是女孩的概率为1/2。而当这个孩子出生后，我们评价她“也是女孩”就要用到1/3的条件概率。 炉石传说新卡转校生是否有可能进入构筑？ 2020.7.21 评价这张卡的时候要考虑标准与狂野棋盘池的差异。 名义上有25种效果，实际在标准模式只能用10种： 可以看出设计师在分配效果时颇有心机，标准棋盘下（尤其是巨龙年）的收益受到严格控制，趋近于一张能带进构筑的跟班。而一些上限、方差比较夸张的效果（减费、给dk衍生物、换技能）都划到了狂野棋盘。蓝贴称转校生停止维护后的模板是“战吼：发现一张对应扩展包的牌”，可以大致推算一下强度基准。 和一般中立卡相比，转校生的数值是超模的，但无法控制随机到的是节奏还是资源收益。比较适合卡位宽裕的中速套牌。此外随机出战吼的几率高达60%，喜欢反复刷的贼萨也可以考虑一下。 对照一下HDT给出的使用率统计，发现上面的印象基本正确。目前相性最好的构筑是宇宙猎，在各个棋盘下都能物尽其用。往下就是一些相对杂技的套牌，转校生提供的娱乐性大于强度。其实宇宙骑之类的非主流构筑用起来也不错。 三国杀和炉石传说哪个更烧钱？ 2020.11.13 同为“卡牌游戏”，三国杀跟炉石根本就称不上竞品。 三国杀本质上是个回合制Moba游戏，不说端游御三家，哪怕是和王者荣耀比一比，就不难看出动辄上百的英雄价格和祈福土豪将有多离谱了。 CCG卡价都差不多，炉石的福利不算最好，但也不至于和同行差出个天壤之别。 说句题外话，三国杀烧钱的恶名很大程度上来自于三国秀将灵等对PVP毫无作用的添头，这些东西不碰也罢。游戏体验上土豪和贫民的差距不会大于QQ飞车（至少在十周年新服是如此）。 1注：十周年新服可免费解锁标准包界限突破武将，许攸戏志才等强将的售价较为合理，而Online旧服需要大量氪金才有机会抽到。 大家对炉石传说11月13号的任务改版有什么看法？ 2020.11.21 这次任务系统重做前，氪金玩家和免费玩家的分界线是啥？ 每个版本的预购，活在段子里的328/488 买了预购意味着60~85包开荒，蓝白基本齐全，剩余的紫橙可以按需慢慢肝出来。对于他们而言，新任务系统反而加快了集卡速度，25级必得橙卡比攒金币开包便捷多了。 如果一分钱不充，就没那么好受了。不仅是因为整体的金币产出降低，经验需求也在随着等级指数上升。不肝满当前经验条就拿不到金币开包，开不了包就缺卡，缺卡就会让天梯游戏体验更糟糕——典型的恶性循环。 1注：即便回归赠送一套准T1套牌，也不过是把新人拉到了天梯的及格线，而且只玩一个职业总会腻的。 128付费通行证的定位更是迷惑，主要卖点是（jpg一般的）皮肤，没有任何实物奖励，经验加成无法即时兑现。连微量氪金稍微改善游戏体验都做不到，有必要买吗？ 之前爆料阶段我对通行证的预期是廉价版预购（128左右），从新版本公布那一刻开始肝，总收益和328持平，这样版本末期的活跃度也得到了保障。然而暴雪偏偏拿日常任务动刀，结果可想而知。 成就系统的问题主要是繁琐的操作。左下角跳提示之后，需要专门去成就栏翻到对应条目点一下才计入进度，多段式成就还得点好几下，就不能做的人性化一点吗？ 如何评价炉石传说术士新卡“提克特斯”? 2020.12.25 不考虑前置减费，为了准时腐蚀688，需要构筑充实的7+费曲线。术士恰好不缺高质量7费牌：744手牌扩容/755灵魂学家/迦拉克隆，再往上就只有扭曲虚空/红龙这种笨重的功能牌了。 换句话说说这张牌的数值平衡得恰到好处，刚好兼容JK残片等体系。如果再高1费就彻底废了。","link":"/2021/02/02/%E7%82%89%E8%BE%B9%E6%BC%AB%E8%AF%9D2/"},{"title":"冠军大厅——传说套牌展览","text":"什么样的套牌能上传说？ 2018.4 任务贼女巫森林版本上线后，任务贼很快迎来了第二春。 一方面是拿到的拼图有点多，索尼娅大大简化了刷任务的流程，新版本还多了213吸血提供回复。 另一方面则是完美契合天梯环境，T1的墙德、魔块术、控制术无一不被克制，在伺机待发+消失的加持下面对中速（比如笨重的恶毒套）甚至能反客为主，天敌快攻完全不成气候。 可惜树大招风，一个月后盗贼任务与狗头人余孽一起遭到削弱，地下洞穴又塌了。 2019.10 异变萨古墓奇谭（狂野回归）上线后不久，萨满迅速确立了天梯霸主的地位。原因无他，异变与野兔的combo太强，准时3+1几乎宣告胜利，同时雷云元素配合低费过载牌能够轻松的返场。 下面这套的独特之处大概在于用深渊魔物替换了海巨人，以及引入了抽8怪作为续航手段。 2020.1 宇宙猎冒险新卡解锁之后，天梯呈现贼德争霸的格局。外挂偷猎者的宇宙猎在面对巨化德的大型魔免生物时能不落下风，也能针对缺乏回复的JK贼。 起起落落无数次，终于赶在本月最后一天打上传说。 2020.4 迦拉克隆战荣誉室补丁带走了苦痛侍僧，对于JK战而言是史诗级削弱，过牌量不再能够支撑怒火中烧+血誓雇佣兵的激怒体系。 天无绝人之路，一位NGA水友引进了销声匿迹大半年的炸弹体系。炸弹可以屏蔽控制套的姐夫红龙，惩罚高速过牌；终端王砰砰有着独特的aoe抗性，能让群体狂乱等AOE抓瞎。同时也免于卡手。 凭借艇长+战斗怒火刷牌，以及铸甲师/炸弹牛仔这样的优质自残卡，JK战对抗主流的龙猎/JK贼均占上风，只输一手巨化德。 2020.5 节奏蛋1注：别的地方恶魔猎手一般简称XX瞎，个人认为叫XX蛋更好听。 作为史无前例的的第十职业，恶魔猎手伊利丹刚问世就拿到了三模式胜率第一，一个版本挨了三刀依然坚挺，这么碉堡的职业还不赶紧体验一下？ 这次主要沿用了主流的偏快节奏蛋框架，不带4+7追求流畅度（尽管当时女祭司还没削弱）。选用深蓝系咒师是因为DH的卡池只有两张1费法术——法力燃烧和吞噬魔法，一些场合可以凭空变出沉默翻盘。 2020.6 法术龙德作为版本末期被重新开发的套路，法术德以其超高的上限在天梯与黄金战队联赛均为热门。 萤火成群+咆哮有不俗的爆发力，但稳定性实在太差，因此放弃超生改用梦境吐息+五条大龙的版本，最终冲上传说。法术德取胜相当依赖运气，只要起手足够胡，DH来了也得服。 2020.7 鱼人骑外域五期补丁之后，DH和盗贼受到重创，天梯环境逐渐转向以猎人为主。于是以攻击频率见长的鱼人骑成功异军突起。 当前鱼人骑的玩法介于安戈洛的正统铺场和奥丹姆的4+8之间，主要靠各种群体buff制造无解的场面劝退对手，返场能力就相对比较差了。具体到单卡，虽然理论上无面腐蚀者+八爪巨怪强度更高，但永不屈服对AOE的抗性实在是太优秀了，抵消一次永恒吐息/黑暗天际就足以奠定胜局。 说句题外话，圣骑士是我从入门就开始玩的信仰职业，早早拿到金头像与千胜皮肤。能在这个骑士有史以来最拉胯的版本上传说，也算是不忘初心吧。 2020.8 跟班动物园看完了通灵学园预览季，人们惊异地发现跟班体系的动物园已经T1了。其崛起路径和上面的鱼人骑差不多，AOE抗性较弱，但返场和过牌比前者灵活太多。 外域动物园有两种胡法，其一是尽可能早地弃掉古手过一大波牌，其二是拾荒小鬼尽可能多地buff到手里的杂毛。第三个核心——塔卡恒的加入补齐了最后的碎片，现在的动物园很容易找到机会发力，整套牌的稳定性一下子上去了。 从钻五到传说仅用时两天，目前为止最速上分。 2020.9 控制龙牧1注；上传说时秘教侍僧尚未削弱，总算跑赢了补丁。 控制向的牧师可以放弃祈求体系吗？一些牧师专精玩家给出了这套精妙的构筑。 解场方面，4+1能轻松偷走大怪，清理杂毛则有吸血炎术士，二者奠定了龙牧对德猎的绝对优势；资源方面，龙族研习和复苏都能凭空变出资源，为此满编了能生成1费法术的随从，同时保留了传统的刷牌手段赛泰克。而龙鳞祭司+亡者复生则将上述两个模块耦合起来，大幅提升关键牌上手率。 这套牌能打出的大小combo非常多，操作起来相当舒爽。 2020.11 奇迹法虽然两张核心橙刚刚被削弱，暗月马戏团还是给了奇迹法不小的补强，在快攻尚未崛起的第一天登上传说并未出乎意料。 首先支线任务被盘活了（触发一次元素链抽3张法术），过去由于稳定性奇差进不了构筑，但现在232元素一张卡就能做完。牌不是万能的，但没有牌是万万不能的，顶着“奇迹的名号”过牌自然是多多益善。更关键的是导演重现标准，10张法术的前置条件随手就能做完，场面劣势再大也能一键翻盘。 至此，十职业传说挑战正式完结。 五年炉石，再无遗憾。 成就记录自从2016年初暴雪推出了天梯奖励，打到5级“拿低保”就成了每个月的小目标（现在是钻石5）。上传说难，但拿低保还是游刃有余，把五年炉石生涯的大小成就记录下来也是很有趣的事情。 点此下载成就记录表，密码：hofhs","link":"/2020/11/18/HS_hof/"},{"title":"《精灵宝可梦 心金》增强版蓝本","text":"集成包括官译在内的诸多功能，用于制作NDS宝可梦改版的蓝本。 概述《心金/魂银》的汉化最早由ACG汉化组于2010年制作，作为主流版本沿用至今。由于年代久远，一些用语已经相当陈旧。 2020年初，Xzonn发布了精校汉化的第四世代游戏，译名全面向官方看齐。然而由于重做了字库，该汉化版无法兼容PPRE等改版工具。 这个蓝本旨在集成一些需求较高的功能，如官译和新属性，从而为改版爱好者提供方便，节约宝贵的时间与精力。 改动内容Rev.1 文本修订 专有名词全部更新至官译。大部分文本移植自Xzonn汉化版，字库中没有的字用“通假字”代替。 解锁帧数限制 可最高以60帧运行 Rev.2 妖精属性 增加妖精属性（替换原？？？属性），属性克制表更新至第六世代。 精灵属性亦替换成第六世代版本（包括家电洛托姆）。 技能替换 将部分技能替换成四代之后的新技能： 替换规则参考了改版《启示录》的说明书。 123456789101112131415161718192021污泥波 泥巴射击火之舞 火焰轮酸液炸弹 胃液热水 盐水伏特替换 电击波疯狂伏特 电光直冲钻 角钻暴风 龙卷风大声咆哮 长嚎冰柱坠击 雪崩潜灵奇袭 暗影拳落英缤纷 甜甜香气魅惑之声 诱惑吸取之吻 吸取嬉闹 撒娇月亮之力 新月舞爆音波 吵闹魔法闪耀 奇迹之眼增强拳 连续拳修长之角 角撞画龙点睛 神鸟猛击 数值更新 精灵的种族值、属性，技能数值全部更新至第七世代。 进化更新 为了照顾单机游玩的体验，对无法正常进化的PM（包括神奥地区限定）指定了新的进化方式： 1234567891011121314151617181920212223进化方式：（升级进化默认白天）牛蛙君--蚊香蛙携带王者之证升级胡地--勇吉拉40级怪力--豪力40级隆隆岩--隆隆石40级河马王--呆呆兽携带王者之证升级飞碟磁怪--三合一磁怪携带磁铁升级耿鬼--鬼斯通40级大钢蛇--大岩蛇携带金属外套升级重甲暴龙--铁甲暴龙携带护身防具升级刺龙王--海刺龙携带龙鳞升级巨钳螳螂--飞天螳螂携带金属外套升级电击魔兽--电击兽携带电力驱动器升级鸭嘴炎龙--鸭嘴火龙携带岩浆驱动器升级草精灵--伊布携带奇迹种子升级冰精灵--伊布携带不融冰升级多边兽2--多边兽携带升级补丁升级多边兽z--多边兽2携带怪异补丁升级朝北巨鼻--朝北鼻携带磁铁升级美纳斯--丑丑鱼携带绚丽外壳升级夜魔人--夜巨人携带灵界之布升级猎斑鱼--珍珠贝携带深海之牙升级樱花鱼--珍珠贝携带深海之鳞升级 Rev.1.5此版本在Rev.1基础上仅增加妖精属性，未做其他修改。 早期版本的Rev.2在修改过程中ROM容量被严重压缩，容易引发CT2闪退，因此建议回退至稳定的旧版本。 相关问题已于2020.12修复。 不予改动的内容 修改精灵分布（所谓“493”） 以替换的形式增加新精灵 修改精灵的特性 这些内容没有统一的标准，应交给改版作者自行决定。 游戏标题LOGO 理由同上，仍保留ACG汉化组的“口袋妖怪”版本。 已知BUG 图鉴无法显示妖精属性。 这是因为游戏引擎没有给？？？属性在图鉴中预留图标，而是以一般属性代替。 使用潜灵奇袭时会提示“训练师失败了”。 使用PPRE输出的ROM大小会下降至120M。 ROM仍然能正常运行。因为该现象，扩容至256M的计划已取消。 幽灵系与龙系克制关系不正确 经检查，属性克制表中幽灵vs龙与幽灵vs恶的克制关系搞反了，已于2021.1修复。 预览截图 1注：图中精灵均由修改器Pokegen生成，仅供测试。 感谢名单 名字 提供的帮助 Xzonn 汉化文案、文本提取工具 再出发、Lunos 解锁帧数教程 Meromero、BluRose 属性克制表修改 青攸子 妖精属性图标修改、数值变化整理 下载地址百度网盘 密码xplu","link":"/2020/09/02/HGSS/"},{"title":"驳北宸“禁马令”","text":"前情提要：旅法师营地编辑“北宸Polaris”于8月10日晚发帖《为什么我在审稿时拒绝带“马”的文章》，公开抵制“赛马”一词在炉石圈内的使用。 先说结论：当今网络滥用脏话的现象有多严重各位有目共睹，北宸呼吁禁马绝非故作清高。但是从社区管理的角度，这个禁令是弊远大于利的，甚至可能引发更严重的动乱。炉石这个游戏的戾气不比LOL之流低，怒骂单卡职业设计师都是家常便饭。但营地炉石区却一直保持着相对和睦的讨论环境，这与群众自觉形成共识是分不开的。而官方人员在过去五年里一直保持与民同乐的态度（三苍企鹅），鲜有出手教营地老哥做事，任性如本尼基也只敢把一家之言藏在文章里。 12注1：三苍（苍苍苍之霜临）与企鹅欧尼酱是上一代营地炉石区编辑，负责发表卡组日报与攻略文章，因其诙谐的人设在群众中有良好的声望。现均已因个人原因隐退。注2：本尼基（Bennidge）是现任营地炉石区编辑之一，主要负责外国新闻及电竞赛事。曾在现开赛、卡面和谐、评价职业选手等话题下发表争议言论。 北宸这个帖子发出来，直接让用户素质问题升级成了官民矛盾。网络社区的用户天然不服管，禁掉一个词可以催生一千种更阴阳怪气的说法，每一句“新话”背后都发酵着针对管理者的怒气。在版务只手遮天的NGA，这种矛盾已经不可调和，三番五次大地震几乎把路人缘败光了。而对于自治传统浓厚的营地，大家给了几位编辑足够的面子，尤其是捧小姐姐，但这不代表能容忍他们指手画脚到自己头上。总而言之，为了一点“无伤大雅”的歪风去动摇整个社区的根基是极其不明智的，望三思。 1注3：这个帖子发出不久就被编辑“乘桴北冥”删除，特此留档，且看营地如何走下去。","link":"/2020/08/11/Yingdi_ma/"},{"title":"三自由度机械臂运动仿真","text":"在MATLAB/SimMechanics环境下，实现对三自由度机械臂运动的连续轨迹控制。 题设条件 机械臂的三个关节均为转动副，初始时刻第一个转动副轴线沿基础坐标系Z轴，其余两个转动副轴线沿X轴。 机械臂杆件结构参数自定，三维模型需包含关节与末端执行器的细节。 机械臂初始时刻姿态自定，运动开始后5s内末端执行器沿直线运动到[x,y,z]，5s后停留在目标点。 求解运动方程机械臂运动由三个转动副的转角控制，q1为杆件1绕Z轴的转角，q2/q3则为杆件2/3绕前一杆件的转角（注意它们并非杆件与水平面的夹角）。 根据几何关系列出目标点坐标[x,y,z]与[q1,q2,q3]之间的方程： x=sinq1(L2cos(pi/2+q2)+L3cos(pi/2+q2+q3)); y=cosq1(L2cos(pi/2+q2)+L3cos(pi/2+q2+q3)); z=L1+L2sin(pi/2+q2)+L3(pi/2+q2+q3); 通过MATLAB符号计算可对上述方程进行运动学反解，但三元方程无法直接求解，需要稍微改动一下： syms L1 L2 L3 q1 q2 q3 x y z u v % It just works q1=-atan2(x,y); % u=x/sin(q1); % v=z-L1; eqn1= -L2*cos(q2)-L3 *cos(q2+q3)==u; eqn2= L2*sin(q2)+L3 *sin(q2+q3)==v; [qs2,qs3]=solve(eqn1,eqn2,q2,q3); [q2,q3]有两组解，选一组代入运动控制函数中： function [q1,q2,q3] = fcn(x,y,z) L1=1.3; L2=1; L3=0.5; u=x/sin(q1); v=z-L1; q1=-atan2(x,y); q2=2* atan((2* L2* v - (L2^2* ((- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2)* (L2^2 + 2* L2* L3 + L3^2 - u^2 - v^2))^(1/2))/(- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2) - (L3^2* ((- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2)* (L2^2 + 2* L2* L3 + L3^2 - u^2 - v^2))^(1/2))/(- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2) + (u^2* ((- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2)* (L2^2 + 2* L2* L3 + L3^2 - u^2 - v^2))^(1/2))/(- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2) + (v^2* ((- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2)* (L2^2 + 2* L2* L3 + L3^2 - u^2 - v^2))^(1/2))/(- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2) + (2* L2* L3* ((- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2)* (L2^2 + 2* L2* L3 + L3^2 - u^2 - v^2))^(1/2))/(- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2))/(L2^2 - 2* L2* u - L3^2 + u^2 + v^2)); q3=-2* atan(((- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2)* (L2^2 + 2* L2* L3 + L3^2 - u^2 - v^2))^(1/2)/(- L2^2 + 2* L2* L3 - L3^2 + u^2 + v^2)); end 杆件结构参数 杆件的长度分别为L1=1.3m，L2=1m，L3=0.5m，横截面积为0.1m*0.1m。初始时刻杆件2与杆件3沿Y轴正方向伸直，与杆件1成90°夹角。 关节实际上是与转动副轴线重合的圆柱体，其长度略大于杆件宽度。末端执行器为长方体+圆柱体组成的滚轮结构，它的质心与杆件3的末端重合。这些附属部分对运动仿真的结果没有影响，建模时质量最好设为0。 SimMechanics仿真模块 确定核心参数之后，就可以在Simulink中搭建仿真模型了，大致分为六个模块： 设立基准坐标（World Frame）、重力加速度、求解精度等基础参数。本次仿真使用的求解器为ode113（Adams） 通过Solid元件建立杆件及其附属的模型，并通过刚体坐标变换相连，详细参数见下表： 题设要求输入时变信号。假设[x,y,z]与时间u之间为一次线性关系，根据目标点初始坐标[0,1.5,1.3]与最终坐标[0.3,0.5,1.2]，可分别解出三个输入方程。再适当添加时钟等元件，构造符合题设的输入效果。 （注意初始坐标极有可能是无法求解的奇异点，可采用[0.001,1.499,1.3]等近似替代） 添加上文提到的运动控制函数，将输入的[x,y,z]转化成[q1,q2,q3]. 控制函数元件可直接与各转动副相连，但是这样运动轨迹偏差会很大。因此需要在中间插入一个PID控制器，转角经其输入转动副，再从转动副引出至比较器，形成负反馈控制。参数如下： Proportional Integral Derivative 转动副1 12000 6000 8000 转动副2 900 750 1000 转动副3 750 375 500 实验证明，PID参数较大时仿真结果线性度较高。 最后将杆件3末端与坐标变换传感器相连，通过示波器或者XY Graph观测仿真过程中目标点坐标的详细变化。 运动仿真结果10s内的运动仿真动画： 观测整个运动过程中的坐标变化，可以看出题设条件（终点位置、沿直线运动、5秒时切换运动模式）均已满足。 后记文中所述的机械臂仿真是卜王辉老师《MATLAB基础及工程应用》的期末大作业。这学期不仅系统地学习了SimMechanics的用法，还顺便温习了机械原理、自动控制原理的相关知识，最终由一项综合性较强的任务收尾，可谓不虚此行。比较遗憾的是未能成功从SolidWorks导入自建模型进行仿真，希望以后能想出解决办法。 点此下载所需工程文件，密码：matlab","link":"/2020/07/10/simmechanics/"},{"title":"如何评价宝可梦大集结（Pokemon Unite）？","text":"巨大争议背后，腾讯版宝可梦的问题究竟出在哪里？ 首先吐槽一下鬼才宣发。虽然稍有常识的粉丝都知道DP复刻不太可能在这个时间公布，但在6.11听到下周还有新东西，总归心存一丝对主系列的幻想（比如盛传的Letsgo金银）。结果来了个手游，就这？和暴雪嘉年华拿暗黑不朽压轴倒是异曲同工。而且从当天国内宣布同步转播来看，这个单独的发布会十有八九是天美方面特意要求的，这就更过分了。 再来谈谈游戏本身，看完发布会很好奇宝可梦到底衍生了多少手游，于是去神百查了一下： 上述名单里有一大半是TPC及其关系密切者制作的（包括6.11发布的刷牙和咖啡厅），也有PTCG与战棋这样的桌游移植品。 12注1：The Pokemon Company与任天堂、Gamefreak的关系请自行百度，对于宝可梦粉丝而言这应该算常识。注2：“关系密切者”指消消乐、打字的开发者Genius Sonority，该工作室开发的NGC竞技场与Wii战斗革命是仅有的使用主系列玩法的第三方旁支游戏。 如果把范围严格限定在“授权游戏”，不妨看看其他代表作是如何拿宝可梦做文章的： 首先是和Niantic合作的Pokemon Go，首发仅包含部分第一世代精灵，后来慢慢补齐至五代，另有孵蛋、超级进化等元素。 其次是去年新出的Pokemon Masters，使用的元素包括一代至七代主系列游戏的所有重要角色，精灵就更不用说了。虽然尚未像FGO那样把动画漫画联动个遍，但这个范围已经相当惊人了。 顺带一提这是正宗的日式抽卡游戏，用“宝氪梦”嘲讽腾讯时先中枪的是它。 现在把目光放回Unite，发现问题所在了么？作为moba游戏它是有一定创新性的，但是用到的宝可梦元素少得可怜，只有英雄模型和技能，也就是大家所诟病的换皮。但哪怕是腾讯的其他动漫ip手游，和原作的关联程度也不至于这么低。 这不禁让人怀疑，TPC和天美合作时到底授权了些啥？是像Go和Master那样自由支配素材，还是只有那么几只高人气PM的形象？如果是后者，那么这次合作的意义不会比联名玩具/皮肤高到哪里去，不要指望做出满足“原创新作”要求的东西了。 阅读原文","link":"/2020/07/01/PMunite/"},{"title":"汽车“四化”对其性能的影响","text":"摘要： 作为当下汽车产业最具代表性的发展潮流和趋势，汽车“四化”分别指电动化、网联化、智能化与共享化。为了更深入地理解“四化”对于汽车发展的意义，本文将基于《汽车理论》教科书中提及的六项基本性能(动力性、燃油经济性、制动性、操纵稳定性、平顺性与通过性)，结合文献与实例，逐一分析四类新技术对汽车性能造成的影响。研究表明，四类新技术已经有了较为成熟，将会极大地改变汽车产业的面貌。 关键词： 新能源汽车；智能驾驶；车联网；共享汽车；汽车性能 工信部《新能源汽车产业发展规划（2021-2035 年）》征求意见稿中，明确“电动化、网联化、智能化、共享化”成为汽车产业发展潮流和趋势。汽车“四化”涵盖了新能源、智能驾驶、车联网等多个业内前沿发展方向，同时积极与移动通信、互联网经济等领域加速融合，面临着前所未有的发展机遇。 在“四化”具体落实的过程中，一部分影响评价方式较为抽象，如安全性、便利性；而另一些影响则直接反应在汽车的具体性能指标上。《汽车理论》中规定了汽车的六种基本性能：动力性、燃油经济性、制动性、操纵稳定性、平顺性与通过性[1]。本文将从上述基本性能及其评价指标入手，分别论述“四化”各自对汽车性能造成的影响。并选取部分具有代表性的技术，结合理论与实例对其进行分析。 电动化对汽车性能的影响电动汽车概述随着能源危机与大气污染问题不断加剧，各国政府与企业逐渐开展对新能源汽车的研究。汽车的电动化是指以电能取代化石燃料作为汽车的能源，动力总成中的内燃机被电动机所替代。根据动力装置结构的不同，电动汽车可主要分为三类： ​ 纯电动汽车（BEV）是指仅由电动机提供动力的汽车。核心动力元件为可充电蓄电池组与驱动电机。按照驱动电机的布置方式不同，纯电动车可分为电机中央驱动和分布式电机驱动两种形式。前者与内燃机车的驱动方案相似，后者则将电机分散到车轮上，进一步缩短了传动链。这类车型可实现行驶过程零排放，产生的废气、噪音污染也较小。 ​ 混合动力汽车（HEV）含有两种或以上的变换器和能量储存系统，目前的主要形式是油电混动。它结合了内燃机与电机的优点，极大地改善了动力性能与续航里程。两种动力系统可分别以串联式、并联式与混联式与传动装置连接。另有衍生出可外接电源的插电式混合动力汽车（PHEV），以及纯电动模式下可满足全部动力性能的增程式电动汽车（REEV）。 燃料电池汽车（FCEV）以车载燃料电池作为动力装置，将燃料（氢气、醇、醚）的化学能以电化学反应方式转变为电能，其效率为内燃机2~3倍，同时不再依赖电网供电。相对地，燃料电池存在质量体积较大，成本高昂的缺陷。 在近十年中，纯电动汽车与混合动力汽车已经广泛投入家用轿车市场，而燃料电池汽车受到氢能供应、制造成本等因素限制难以商业化。因此，本章对电动汽车性能的分析将主要着眼于前两类。 电动化对汽车动力性的影响特性分析​ 与传统内燃机汽车一样，电动汽车的动力性指标仍然为最高车速、加速性能与爬坡性能[1]。对于混合动力汽车，还需考虑不同驱动模式下的动力性。 ​ 为了研究汽车的驱动力，可绘制发动机转速特性曲线。汽油发动机的外特性曲线如图2-1所示。发动机功率Pe与转矩Ttq随着转速n0增加而上升，到达某个特定转速np/ntq后开始下降。 而对于纯电动汽车的驱动电机而言，其外特性曲线与内燃机截然不同，如图2-2所示，电机的工作特性被额定转速n0分为两个区域，n0以下电机功率随转速线性增长，转矩恒定；n0以上功率恒定，转矩随转速呈双曲线型下降[1]。 通过分析两类动力装置的转速特性曲线差异，可以发现驱动电机具有低速高扭矩的特性。电动车在额定转速之下（如起步时）可以一直以Tmax输出。相较而言，燃油车的发动机在低转速时进气量少无法输出较强的扭矩，故电动车的起步更快，加速性能更强。但在恒功率区，扭矩会随着转速增大而减小，加速变得困难，因此电动车的最高车速往往低于燃油车。同时由于n0的数值较低，使得电动机受到外界阻力突然加大时输出功率会自动变小，爬坡性能相对较差。 实例对比为了验证上述结论，可选取代表性的市售车型进行研究。根据搜狐汽车数据库（db.auto.sohu.com）提供的车辆基本参数，将价位相近的车型（尽量选择年份较新的款式）列在同一张表中比较，如下所示： 表1-1 中型汽车性能参数 车型 奔驰 C260L 宝马 改款325Li M 特斯拉model3 价格（万元） 34.68 34.69 34.405 动力类型 汽油机 汽油机 纯电动 最大功率（kW） 135 135 202 最大扭矩（N·m） 280 300 404 最高车速（km/h） 236 235 225 百公里加速时间(s) 8.5 8.1 5.3 表1-2 小型汽车性能参数 车型 丰田 C-HR 本田 XR-V 吉利 缤越 ePro 价格（万元） 16.88 17.59 16.98 动力类型 汽油机 汽油机 混合动力 最大功率（kW） 126 130 190 最大扭矩（N·m） 203 220 415 最高车速（km/h） 185 200 165 百公里加速时间(s) 10 9 6.9 表1-3 不同价位的纯电动汽车性能参数 车型 特斯拉model3 众泰 Z2500EV 江淮 iEV7L 价格（万元） 34.405 21.19 8.95 动力类型 纯电动 纯电动 纯电动 最大功率（kW） 202 95 50 最大扭矩（N·m） 404 260 215 最高车速（km/h） 225 140 120 百公里加速时间(s) 5.3 10.5 12 分别对表1-1、表1-2进行分析，发现无论是混合动力还是纯电动汽车，均满足最大扭矩与百公里加速时间较强，而最高车速偏弱的特性，证明上节所述的结论基本正确。比较表1-1与表1-2，以及表1-3中的三种车型，易观察到不同价位与规格的电动汽车之间性能亦存在差距，小型车全面弱于中型车；低价位的国产电动车更是与高价位的特斯拉性能存在天壤之别。这符合传统汽车的市场规律，同时证明新能源汽车领域已经产生了一定的技术壁垒，掌握前沿技术的企业可制造出动力性遥遥领先的产品。 电动化对燃油经济性的影响特性分析与内燃机汽车的百公里油耗类似，纯电动汽车的经济性指标主要包括能量消耗率与续航里程。能量消耗率指的是试验循环中动力电池消耗电能与行驶里程比值，单位W·h/km；续航里程则是指完全充电状态下按一定工况行驶的最大距离，单位为km。对于混合动力汽车，由于能量最终来源于燃油，需折合成燃油消耗量指标L/100km。 电驱动部分的效率主要取决于动力蓄电池系统与驱动电机系统。常用的蓄电池种类包括铅酸电池、镍氢电池和锂离子电池等，它们的性能指标各不相同，如表1-4所示。锂电池的比能量较高，且自放电率较低。这意味着相同质量下输出的电能更多，且正常保存状态下能量流失率更低。 表1-4 不同类型蓄电池的性能指标[2] 电池种类 铅酸蓄电池 镍氢电池 锂离子电池 单体工作电压（V） 2.0 1.2 3.7 比能量（Wh/kg） 35-40 70-80 120-150 循环寿命 40-1000 1000 &gt;1000 （每月）自放电率 30% 20% 3% 目前最具应用前景的比亚迪“刀片电池”，在磷酸铁锂电池基础上大幅提升能量密度，减小成本与体积。搭载“刀片电池”的汉 EV 车型续驶里程能够达到 605km，电池能够使用 8 年，累计行程可达 120 万公里，相比于目前电动汽车 3 年 10 万公里而言有着极大的提高[2]。 在动力电池充/放电的过程中，其电动势、内阻和端电压主要受电池荷电状态（SOC）、温度、排列方式等因素的影响，温度的影响尤为显著。研究显示（图1-3），市售电动汽车在高温（35℃）与低温状态（-7℃）下续航里程大幅下降，平均下降比例为17.3%和40.4%，且微型汽车受到的影响明显更大[3]。这主要是因为在高温环境中电机电流随着温度的升高而增大，损耗的能量也同时增加；而低温环境中电池内阻增大，放电性能随之降低。考虑到同一车型可能在日照、纬度差异较大的区域使用，提高动力电池在极端温度下的性能对改善经济性至关重要。 对于驱动电机，则需要根据T-n效率特性曲线（图1-4）寻找高效率工作区域，从而延长续航里程，优化经济性。一般而言，高效区覆盖面占比越大，系统效率特性越高。 混合动力控制策略在传统的内燃机汽车中，通常主减速器变速器的传动比由燃油经济性—加速时间曲线（C曲线）确定，其目的是为了确保发动机能工作在高功率/低燃油消耗率的区域，兼顾动力性与燃油经济性。对于混合动力汽车，动力系统控制的原则与燃油车类似，还要解决多动力源引发的动力切换和功率分配问题，故需要引入能量管理系统以进一步优化经济性。 发动机和电机两套动力系统需要通过一定方式耦合。采用转矩/转速耦合方式时，可分别通过控制电机转矩/转速来调节发动机转矩，使其工作在最佳油耗区域附近；采用功率耦合方式时发动机转矩和转速均可自由控制，进一步优化了发动机工作点。以丰田 THS 功率分流机构为例（图1-5），发动机与发电机通过单排行星齿轮组件进行转速耦合，两者的合成动力与驱动电机再进行转矩耦合[4]。两组行星齿轮组合可实现无级变速功能，保证发动机在经济区域高效运转。 对于以发动机为主动力源的HEV汽车，可采用电机辅助控制策略。发动机和电机的运行状态由蓄电池荷电状态（SOC）来划分，如图1-6所示。起动或者系统需求转矩过低时，关闭发动机，驱动电机提供全部的动力；需求转矩较高时，发动机和驱动电机同时工作；制动或SOC过低时，电机切换到发电状态，从系统中回收能量（发动机为其充电）。或者可以从静态条件下的发动机万有特性出发，找到最佳工作曲线，称之为优化ICE曲线控制策略。 智能化对汽车性能的影响智能汽车概述根据我国发改委公布的《智能汽车创新发展战略》征求意见稿， “智能汽车”是指在普通车辆的基础上增加了先进的传感器（雷达、摄像）、控制器、执行器等装置，通过车载传感系统和信息终端实现与人、车、路等的智能信息交换，具有部分或完全自动驾驶功能，由单纯交通工具逐步向智能移动空间转变的新一代汽车。 从汽车工业整体发展的角度，智能驾驶集中运用了计算机、现代传感、信息融合、通讯、人工智能及自动控制等技术，是典型的高新技术综合体。细化到应用层面，智能化的浪潮早已覆盖了汽车设计的方方面面，在部分领域造成了颠覆性的影响。本节将选取部分具有代表性的智能汽车技术，结合实例分析它们对各项汽车性能指标的影响。 智能化对制动性的影响​ 制动性是汽车的一项重要性能，直接关系到交通安全，因为重大事故往往与制动距离太长、紧急制动时发生侧滑有关[1]。制动性主要有三个评价指标：制动距离/减速度、制动恒定性（抗热衰退）、制动方向稳定性。传统汽车使用的防抱制动装置（Antilock Breaking System，ABS）已经加入了电子系统控制液压管路释放制动器的压力防止车轮抱死，而智能汽车利用信息技术改善制动性的手段则更为多样。 众所周知，驾驶员在接收紧急停车信号后需要经过一段延迟后才能移动右脚踩下踏板，实际行车中这段距离将会被累积到制动距离中。而在智能车辆中，制动时机将更多地交由计算机判断。首先由自车传感器系统和车载毫米波雷达对车辆行驶状态及行驶环境进行感知，上位控制器依据安全距离模型判断车辆与前方车辆(或障碍物) 的碰撞风险，并确定当前自车与前车(或障碍物) 之间的安全距离，然后计算出当前车辆的期望加速度。下位控制器根据期望加速度，对车辆制动系统进行控制，保持车辆的安全距离，以达到智能汽车安全行驶的目的[5]。 为了追求更高的智能程度,最终实现无人驾驶，必须考虑传感器可能存在的工作盲区。现有安全制动技术都是基于环境感知传感器可感知到的障碍物进行主动避撞算法的研究。但是，由于传感器工作原理和外界环境的限制，在复杂道路环境下，由于高大树木、建筑物的遮挡，环境感知传感器不能准确感知到障碍物，智能汽车在一定范围内会出现传感器感知盲区[6]，图2-1为典型的传感器感知盲区场景。为了消除感知盲区可能造成的危害，可引入卷积神经网络（Convolutional neural networks, CNN），通过处理大量具有特殊感知盲区特征的图像样本，进行识别分类，从而控制汽车对盲区内的潜在障碍物进行主动避撞控制并保持安全距离，提高了行车安全性。 智能化对操纵稳定性的影响​ 在评价汽车操纵稳定性时，往往把整车视为一个控制系统，通过转向盘输入一个角位移/力矩，然后研究转向系对它的稳态/瞬态响应。智能驾驶系统采用计算机控制，需要对传统的机械转向机构进行改良，线控转向(Steer-by-wire, SBW)技术由于易实现集成控制而日益受到重视。 与传统转向系统不同，线控转向系统取消了从转向盘到转向执行器之间的机械连接，通过电机直接控制转向轮转角，如图2-2所示。线控转向系统增大了车辆转向的力传递特性和角度传递特性的设计空间，方便了集成动力、悬架等其他子系统。此外，线控转向系统可以通过有效的路感反馈信息，优化对转向输入的响应，提高各种工况下的车辆操纵稳定性。其优点在于增大了车辆转向的力传递特性和角度传递特性的设计空间，方便了集成动力、悬架等其他子系统[7]。 研究表明，通过设计合适的控制系统，SBW 系统可以有效跟踪瞬态与稳态工况下的转向轮转角，完成实时调节。目前常用的控制策略为内模控制与滑模控制，二者在实时跟踪转向轮转角时各有优势。在实际驾驶过程中，实时故障诊断和容错设计也很重要。在智能车辆普遍安装多种传感器的条件下，为了提高反馈控制的可靠性、安全性，可借助横摆角速度信号、侧向加速度信号和转向执行电动机电流信号，基于卡尔曼滤波的方法对转向管柱转角传感器进行实时故障诊断和容错设计。根据故障诊断和容错设计的结果，提供一个可靠的容错转角，保证系统能稳定运作[8]。 智能化对平顺性的影响​ 汽车的平顺性主要指行驶过程中产生的振动与冲击对乘员舒适性的影响。作为接受路面不平度信号的首个弹性元件，轮胎的性能对平顺性至关重要。随着汽车智能化的推进，轮胎将不再是车辆上被动的橡胶复合体, 而是车辆控制系统中影响车辆驾驶安全性和舒适性的重要组成部分, 能为车内和外部用户的控制系统提供数据信息。 智能轮胎技术最基础的应用是轮胎气压检测系统，可分为在每条轮胎中安装压力传感器的直接型监测系统，以及依靠ABS系统中轮速传感器判断胎压是否正常的间接监测系统。该系统能实时监控并调节每个车轮的内部压力，防止轮胎渗漏导致气压不足所造成的事故。 此外，轮胎在行驶过程中因生热而逐渐升高温度，高温加速橡胶,帘线等高聚物的降解，从而导致轮胎使用寿命缩短，因此需要轮胎温度监测系统。它由两部分组成：植入轮胎胎体内的微型传感器，以及装在汽车驾驶室内的接收器/数据读出器。 智能轮胎技术亦可监测轮胎的受力，变形等动态力学状况，向汽车自动驾驶系统提供数据。同时具备历程可追溯性，在制造-出厂-使用(包括维修,翻新)-报废全过程中的每一阶段均有资料记录,可以随时提档查阅。 目前许多制造商已经推出了各具特色的智能轮胎产品。美国固特异轮胎公司开发的Unisteel智能轮胎提供了自动报警功能，在轮胎温度超过设定值、轮胎气压偏离设定值和轮胎脱离车轴的情况发生时，会自动鸣笛；法国米其林轮胎公司的MEMS智能轮胎可通过计算机程序所有被监测的轮胎的数据加以整合并显示；德国大陆通用轮胎公司推出的CGT智能轮胎在橡胶中掺入金属粉末，行驶过程中被磁化交替形成正负极，产生能反映出轮胎受力变形情况的特殊信号，再由传感器进行捕获，经由车载计算机处理，应用于汽车动态控制中[9]。 为了更充分地发挥智能汽车的潜力，人们逐渐设计出一些更加前卫的产品。2016年，固特异推出了球形概念轮胎 Eagle-360。这是一款3D打印的球形智能概念轮胎，专为自动驾驶汽车设计打造，同时具备智能感应、判定、变形以及互联等功能。轮胎的3D打印胎面为模仿脑珊瑚形状的仿生结构，能像天然海绵一样改变硬度与形状。在干燥路面时，轮胎会自动变硬，降低摩擦；在湿滑路面时，胎面则变软，减少打滑现象,并且依靠多面性能减少诸如侧滑、路面结冰等问题[10]。或许球形才是轮胎的最终形态。 网联化对汽车性能的影响网联化概述​ 在汽车智能化的基础上，网联化集成了现代通信与网络技术，通过“车联网”的方式将孤立的车辆个体融入整个智能交通系统中，提供更安全、更节能、更环保、更便捷的综合城市交通解决方案。 车联网是按照既定通信协议和数据交互标准，实现车辆以V2X（Vehicle to everything）动态地与周围的车、路、行人及云端网络之间进行信息共享交换。值得注意的是，目前移动通信技术正在经历从4G到5G的更新换代，5G的高速率、低时延和高可靠性对于车联网而言足以引发质变。正因如此，部分通信技术企业（如华为）逐步开始于汽车企业合作，意图携手打造智能网联汽车生态圈。 网联化的典型影响​ 作为智能化汽车的延伸，网联化对汽车性能的影响与之大同小异，都是借助传感器与计算机辅助实现对整车部件的精密控制，改善经济性/制动性/操纵稳定性/平顺性等。然而，凭借与周边环境以及互联网通信的功能，智能网联汽车(ICV)相比单纯的自主式智能汽车存在独特的优势。 高精度地图与定位是车辆重要的环境信息来源。目前中国内地几大图商都在积极推进建设面向车联网的高精度地图，基于北斗地基增强系统的高精度定位系统将为智能网联汽车提供低成本广覆盖的高精度定位方案。 在获取上述信息后，首要的应用场合是高速公路与城市低速区域。高速公路的车道线、标示牌等结构化特征清晰，交通环境相对简单，适合通过自适应巡航控制系统改善燃油经济性并提升行车安全性。车联网背景下的多目标协调式自适应巡航控制 (multi-objective coordinated adaptive cruise control, MOCACC) 系统可同时分析道路状况及前后车相对位置，相较传统的线性二次型自适应巡航控制系统（LQACC）降低油耗更为显著[11]，如图2-4所示。同时可接入车道偏离报警(LDW)、车道保持系统 (LKS)、 自动紧急制动 (AEB)、自适应巡航控制 (ACC) 等驾驶辅助系统。 而在特定的城市低速区域内，可提前设置好高精度定位、采集好高精度地图，在特定区域内实现的自动驾驶，如自动物流运输车、景区自动摆渡车、园区自动通勤车等。 此外，通过车间通信，可将单一车道内的相邻车辆进行编队，根据相邻车辆信息自动调整该车辆的纵向运动状态，最终达到一致的行驶速度和期望的构型。车辆队列化之后可执行加速—滑行式策略(pulse and gliding, PnG)，首先提升发动机负荷至最佳工作点，使车辆加速至较高速度，然后将发动机置于怠速状态，让车辆滑行至原速度；周期重复这一过程，利用车身实现动能的存储与释放，同时提升汽车的动力性与经济性。[11] 共享化对汽车性能的影响共享化概述搭乘共享的汽车出行并不是一个新兴的概念，公交车、出租车等均能归入共享化的范畴。如果将用户的身份限定为驾驶员，则可将共享汽车分为C2C的网约车与B2C的汽车租赁。在共享经济的风口上，从传统汽车租赁业中又分化出一批平台，通过移动端应用提供新能源汽车分时租赁服务，例如EVCARD、GoFun等。由于其集成了大量汽车行业与互联网经济的新概念，人们对“共享汽车”的绝大部分印象都指向这些平台，而它们确实代表了当前汽车共享化的发展趋势。 共享汽车性能前景展望从可选车型来看，目前的共享汽车平台提供的大多是国产（江淮、长安）或者合资（荣威、宝马）品牌的纯电动汽车。这些汽车的性能与市售版本毫无差异。 尽管现状如此，但是我们并不能断言汽车的共享化对性能完全不会造成影响。对于使用者而言，私家车与共享汽车的地位是截然不同的。前者是大宗的私人财产，需要应付各种距离的复杂路况，还得支付额外的费用于停放与养护；而后者只是一次性代步工具，往往用于固定路线的短距离通勤，杂项费用平均分摊于租赁费用之中。这种差异与当前共享汽车平台直接将家用车型用于共享的做法存在矛盾。 不难预见，未来的汽车企业将会推出用于共享服务的定制车型。这些特殊汽车的动力性只需满足最低的市内通勤需求即可，没有必要像家用轿车那样堆砌性能，甚至可以舍弃一些仅在私家车中有意义的功能，从而节约了大量的成本。相对而言，经济性就显得格为重要，共享汽车的运载客流人次直接取决于续航里程，解决方案包括大容量电池以及密集的充电桩网络。除此之外，智能化、网联化技术的引入可大幅提升共享汽车的操纵稳定性与平顺性，辅助驾驶系统能尽可能优化道路拥堵、狭区泊车等公共交通问题，同时确保驾驶经验薄弱者使用共享汽车时也能安全上路。 结语 “四化”并非四种毫无交集的趋势，而是在互惠互利中递进发展。汽车的电动化不仅顺应了节能减排浪潮，更在传统内燃机体系之外开辟出一条全新的发展路线，大有颠覆当前汽车工业技术壁垒之势；智能化提供了电动汽车所需的精密控制系统，同时以强大的辅助功能将驾驶员从感官局限性中解放出来；网联化在智能化的基础上增加了与外界交互的能力，提供了更多扩展可能性。作为新兴技术的集大成者，共享汽车的概念从技术层面外延到了市场层面，甚至有衍生出全新产品类别的潜力。 通过研究汽车的具体性能指标，可很直观地认识“四化”带来的影响。对于动力性与燃油经济性，电动汽车与传统内燃机汽车相比有着得天独厚的优势，升级之后的电控系统也能更完美地掌控发动机工况。而对于制动性、操纵稳定性与平顺性，在遍布整车的传感器与云端大数据的合力协作下，智能网联系统的发挥空间非常大。 “四化”的影响不仅体现在汽车性能本身，更体现在汽车行业的方方面面。除了传统车企，互联网公司、造车新势力、移动出行服务平台纷纷迈入，为这个行业增添魅力的同时也加剧了竞争，有力推动了汽车产业的生态变革和竞争格局重塑。汽车本身的定位与价值也在发生变化。在过去百余年时间里，汽车同时承载着作为交通选择的工具意义以及作为身份象征的社会意义，而在当下，汽车被赋予了更多新的社会功能，如手机、移动办公室、第三居室、娱乐空间等[12]。尽管目前这些新的社会功能尚处于概念阶段，但这个行业给我们描绘的未来出行愿景却日渐清晰，也让消费者充满期待。 我们相信，技术会让生活更美好。 123456789101112131415参考文献：[1]清华大学. 汽车理论（第六版）[M]. 北京：机械工业出版社，2018[2]胡敏,王恒,陈琪.电动汽车锂离子动力电池发展现状及趋势[J].汽车实用技术,2020(09):8-10.[3]戴天禄,隋航,周博雅,陈光,孟庆宇,孙志诚. 不同环境温度下纯电动汽车续航里程测评方法研究[C]. 中国汽车工程学会（China Society of Automotive Engineers）.2019中国汽车工程学会年会论文集（4）.中国汽车工程学会（China Society of Automotive Engineers）:中国汽车工程学会,2019:750-753.[4]张立庆,李旭,于镒隆,靖春胜.混合动力汽车动力分配结构及耦合模式分析[J].小型内燃机与车辆技术,2020,49(02):91-96.[5]袁朝春,范兴根,袁慧颖,沈捷,陈龙,贝绍轶.智能汽车并联电控液压制动系统设计与试验[J].农业机械学报,2017,48(05):369-376.[6]袁朝春,王桐,何友国,SHEN Jie,陈龙,翁烁丰.传感器感知盲区条件下智能汽车主动制动系统控制研究[J].农业机械学报,2020,51(02):363-373.[7]罗建南,朱光钰,杨浩瀚,喻凡,陈俐.线控转向系统的前轮转角跟踪策略研究[J].机械工程学报,2019,55(22):165-173.[8]章仁燮,熊璐,余卓平.智能汽车转向轮转角主动控制[J].机械工程学报,2017,53(14):106-113.[9]李心阳.国外新型智能轮胎[J].中国橡胶,2002(11):26-27.[10]冯普凌.固特异公司智能轮胎技术创新研究[J].现代橡胶技术,2019,45(02):1-8.[11]李克强,戴一凡,李升波,边明远.智能网联汽车(ICV)技术的发展现状及趋势[J].汽车安全与节能学报,2017,8(01):1-14.[12]李静.汽车“新四化”时代消费者出行方式探究——一个日常生活的视角[J].汽车纵横,2018(11):64-67.论文的内容、格式与排版按照同济大学学报（自然科学版）的相关要求完成。 点此下载PDF格式论文，密码：8000","link":"/2020/06/03/%E6%B1%BD%E8%BD%A6%E5%9B%9B%E5%8C%96/"},{"title":"金正恩版《小苹果》","text":"404——文章含有敏感内容，无法在国内网站公开发布 2014年，筷子兄弟的《小苹果》爆红，各种版本的沙雕视频层出不穷。 其中就包括下面这个恶搞金正恩（和一票政坛名人)的版本： 2014 原版 据说金将军看到这个视频龙颜大怒，直接以外交手段对中国发起了抗议。 因此它在国内的所有视频网站销声匿迹，一度被认为失传。 但是，这个视频被Youtube的小苹果官方频道收录，至今活的好好的。 而且还有续集——2015—2017每年一部。 虽然续作质量一年不如一年，但是这种独特的亚文化能得到传承还是令人惊喜。 2015 2016 2017 奥巴马：劳资终于退休了！ 用今天的眼光看，金正恩版《小苹果》的技术力相当的低，换头剪辑我上我也行，甚至连B站鬼畜区的入门水平都达不到。但就是这么一个粗糙的小视频，当初能让一群高中生笑得肚子疼，过了好几年还念念不忘。 所以说单凭“好笑”二字，今天那些集浮夸简陋尴尬于一体的土味视频在网上收获巨额点击量也不足为奇，找乐子（时髦一点的说法叫生草）是生活不可或缺的成分。","link":"/2020/04/29/%E9%87%91%E6%AD%A3%E6%81%A9%E5%B0%8F%E8%8B%B9%E6%9E%9C/"},{"title":"阅读指南","text":"Xcellerate+ 的正确打开方式： 归档 Archives按照发布时间对文章进行排列。 为了让时间线更直观，首发于知乎等平台的文章将保留原始发布时间，而原创文章一般不会晚于建站日（2020.4.22）。 分类 Categories按照来源对文章进行分类。 目前收录的文章主要是在知乎的回答/文章，亦有首发于此的作品。 所有被搬运的内容均经过重新排版，部分内容有作修正甚至重写，一般不做特意标注。 标签 Tags普通标签按照内容对文章进行分类，大部分按字面意思理解即可。 公告 生活 时政 技术 ACG杂谈（包括影评等） 炉石传说 宝可梦 文艺复兴（怀旧向的娱乐内容考据） 特殊标签一些文章具有特殊的属性，使用不同的颜色标注。 失效：部分文章（例如游戏攻略）具有时效性，其内容在当前可能不再适用。 404：顾名思义，文章中涉及敏感内容，在知乎/贴吧/B站等国内社区无法正常发布。 扩展：文章中的内容将会不断更新，其发布日期（在时间线中的位置）也会随之变化。 关于 About可以找到我在各个社交平台的联系方式，点击网页右上角的小图标亦可。 评论与打赏基于Valine的评论并不需要注册账号，昵称、邮箱等均为选填。 点击打赏按钮会显示微信转账二维码，扫码打钱就完事了。","link":"/2020/04/27/readme/"},{"title":"炉边漫话（合集）","text":"整合了2017~2019年在知乎”炉石传说“话题下零散的回答. 1注：部分时间较早、前瞻性的回答已经不适用于当前的游戏环境，请谨慎参考！ 如何看待猎人新橙卡”卡瑟娜·冬灵”？ 2017.11.21 从现有构筑来看，这张橙卡在标准（用野兽填补低费曲线）中速猎里是有价值的，可以作为卡组顶端曲线。 现有的“大哥”中dk偏逆风，容易卡手（变身就意味着放弃稳定直伤，只能在场面不优而对面血量很高时使用）；骨魇偏顺风，需要场面支撑。而这张橙卡拍下去能铺场+赖场，大部分场合都能起效。 有人提到战吼小老虎亡语鹦鹉，下限太低的问题。小老虎狼外婆这种低费卡在前期必不可少，但到了后期几乎毫无卵用。假设我们一费准时小老虎，随着回合的推移牌库里的另一张小老虎作用就会越来越低，成为阻碍我们抽大哥的废牌。这个时候866把它招募出来，虽然场面亏了，至少压缩了牌库避免鬼抽。这一点比767弓箭手这样纯粹看墓地里野兽质量的牌强。 这张牌还有亡语属性，可以被巴内斯4费拉出来提前招募一个野兽（拉狮子直接赢了）。还有不少回答提到了用546亡语跃迁者加速，说不定亡语中速猎这个版本真的能崛起。 放弃低费，投入少数高费野兽打combo的“大哥猎”极其吃牌序，上限也不会比极巴猎高到哪里去。其优势在于可以投入322找人，不过也仅此而已了。 如何看待萨满新橙卡”撼世者格朗勃尔”？ 2017.11.23 这张牌是元素，而萨满有两张强战吼职业元素。 877卡里莫斯，战吼闪电风暴/火球术/铺满场是什么强度大家都懂得，如果被677捞回来下回合就能再战吼一次，还只要一费。 211火羽先锋（元素跃迁者）。首先这张牌只要两费，能和677同一回合打出。然后战吼能给手里捞回来的1费元素继续减费，1-1=0，可以铺一大波。就算没有被677回手，手里的元素费用也被减了好几次。 还有中立的545，766，捞回来返场补牌一气呵成。总之我挺看好这张牌的，元素萨崛起指日可待。 炉石传说里面有没有一开始很烂,但是因为与新卡的梦幻combo而一跃成为神卡的？ 2017.11.25 2015 冠军的试炼 有这么一张牌 5/5/4 激励，将一张1/2/2的侍从置入手牌。 这玩意要怎么进构筑？ 2017 冰封王座的骑士 暗影收割者安度因 宇宙牧用这张牌一回合打14，顺便铺满场，直接化身奴隶战了。 炉石传说中为什么要选择用血法师而不是狗头人？ 2018.7.4 显然我们不能指望一个亏身材的2费生物能站住，因此血法和狗头的正确用法是与伤害性法术在同一回合打出，相当于一次性的法伤+1。此时狗头多出的11身材就没用了，远远不如血法潜在的压缩牌库效果。 比较卡牌强弱还是要看核心功能，拿蓝龙帕奇斯类比其实不太合适。 如何看待卡牌的完爆现象？ 2018.7.8 狭义完爆：卡牌A在任何情况下优于卡牌B 显然满足狭义完爆的牌在炉石中不存在，可以拿攻高误导血厚沃金之类的理由无限抬杠。 广义完爆：在同一套构筑/竞技场套牌中，AB都能满足套牌的最低强度需求，且投入A的强度高于投入B 这个定义首先排除了跨职业完爆（同一套牌），其次不再纠结314 351之类严重劣模进不了任何构筑的卡牌（强度下限）。 广义完爆对于炉石构筑的意义在于调整卡组强度。事实上，奇迹贼、动物园之类的常青体系多次变迁，不断加入新的超模卡，就是通过多次广义完爆迭代完成的。 炉石传说巴库设计的怎么样，如何评价？ 2019.1.12 自从15年图哈特问世，炉石多了9个衍生的升级英雄技能。 这些技能原本各有名字，但当年的国服一律翻译成“强化XXXX”。 牧师的升级技能叫“强化次级治疗术”，盗贼的2//2刀叫“强化匕首精通”。 直到3年之后，巴库把升级技能重新带回了标准。 女巫森林上线前，人们惊讶地发现升级技能的翻译被修正了。 就这一点而言，巴库功德无量！ 如何评价炉石传说巨龙年荣誉室成员？ 2019.2.28 发布不到一年的卡强行退环境，一退就是一个体系，这是不惜自己打脸也要拨乱反正，给新卡一个未来。 马后炮一下，如果当初青玉护符、帕奇斯、盗贼任务等前朝余孽通过这个手段被强行移出标准，是否会少很多平衡上的隐患？ 青玉德海盗战不会再肆虐一年，任务贼也不会三番五次死灰复燃。虽然天梯总有巫妖王，但玩家不必连着N个版本忍受大量同质化对局了。 如果眼光再远一点，海怪年（2016）前夕选择将砰砰、科学家、洛欧赛布等特定单卡移入荣誉室，而不是简单粗暴地把整个包一次性退掉，环境的多样性是否又会提升？ 君生我未生，我生君已退，随着卡池不断加深，又有多少当年的逗比被盘活？ 炉石盗贼新卡武器4/4/2强在哪里 ，为什么那么多贼带？ 2019.5.15 首先矿锄的亡语负面效果还是很严重的，打算砍第二刀的时候经常因为担心回手不该回的随从（比如荆棘帮暴徒）而畏首畏尾，被软吃也少打了不止4点伤害，可能就此再也无法抢回场面。 那么它强在哪里呢？主要是海盗-武器体系太强。4费挂刀带两个033是一波强力展开，5费绿皮船长又能规避亡语砍第二刀。然后上述所有牌都能被一张团伙劫掠检索。在伺机代发的加持下团伙劫掠能免费过3张牌，剩下的费用正好拿来刷大范和恶霸…… 不说了，节奏贼天下第一，这种从1费强势到10+费的套牌没有不被削弱的。 1注：回答中分析的是暗影崛起版本未削弱的节奏贼。 从公测到现在，炉石传说削弱得最正确的是哪一张牌？ 2019.5.21 设计失误级：一个版本都没活过的卡 蹩脚海盗 探索地下洞穴（削弱两次） 传播瘟疫 通道爬行者 欢乐的发明家 怪盗恶霸 档案员艾莉西娜 除了档案员，哪一张不是出道即巅峰，把削弱写在脸上的？ 炉石传说出一张 8～10 费的裂解魔杖合理吗？ 2019.7.2 7/2更新： 设计师也上知乎吗，这么迫不及待地给牧师印了个超级aoe，看得出对于强制消灭的效果还是很谨慎的。 原答案： 1注：原答案写于奥丹姆奇兵公布之前。 首先10费卡本来就难以套用正常的模型，没有超额的效果很难进构筑，参考终极感染（当然和小德的跳费放在一起又是另一回事了）。 所以出现10费的裂解魔杖不足为奇。 7-9费的话参考烈焰风暴和心灵尖啸，作为一个非对称清场效果有些过分。 再考虑一下职业各自的特性 作为萨满职业卡的话可以做成低费带高过载，这个其他答主也提到了，在确保标准没有解过载的情况下甚至可以做成元素毁灭这样的抢节奏牌。 反正萨满缺优质aoe，给什么就得用什么。 同样缺aoe的还有骑士，生平削弱以后骑士的解场能力低迷，这张大型aoe搭配暂避锋芒可以大有作为。 牧师倒是不缺aoe，每年年末都来一张，或许裂解魔杖可以在标准客串一下尖啸。 德鲁伊能跳费，而且极度缺解，10费裂解魔杖的强度不亚于终极感染。但在没有平衡的标准跳费德能走多远有待观察。 盗贼比较微妙，伺机代发可以拿高费法术抢节奏，但7费清场真的比得过3费消失么？ （然后消失被削弱了） 讲道理消失在伺机代发体系下确实是优质aoe，克死按费拍怪的中速卡组，任务贼反复诈尸也跟它脱不了干系。 法师的aoe曾经有567素质三连，暴风雪呼啦还都不退环境，冰系法术甚至能顶住超展开。然而控制法差的并不是aoe而是优质大哥、终结手段。 战士和术士有一万个aoe，但他们还是需要一张裂解魔杖，因为拿一地解不干净的亡语没办法（机械大军，送葬者，魔块） 哦对还有猎人，猎人死于解场，也几乎没有可用的高费aoe。即便如此一个稳定清场的祖尔金作为终结手段也靠谱了许多。 总结：裂解魔杖最适合的费用是10费，在防守场合很难发挥单方面清场的优势，但是可以一卡解决亡语系超展开，在特定职业手里有发挥。 附上本人diy的aoe牌一张: 三国杀锁定技一定有负面效果吗？ 2019.7.25 这个问题的历史意义在于，它是“炉石传说有没有完爆”的祖宗。 本来只是三国杀贴吧用来抬杠玩的诸多神论之一，什么咆哮八阵奇才都能给你分析出负面效果。 炉石火了以后吸引了一批三国杀老玩家，也把这种风气带到了另一个贴吧，什么完爆口诀詹姆斯之类的烂梗应运而生。后来正式走出贴吧，成为了卡牌圈共同的笑料。 当然从帖子的讨论氛围可以看出，炉石完爆早已失去了三国杀时代的“学术性”，纯粹为杠而杠罢了。 为什么影之诗没有炉石火？ 2019.9.12 先发优势，或者说新入坑成本问题 1.ccg游戏的收集机制，本质上是用时间或者金钱换取奥术之尘，然后用尘换取特定的卡牌。 2.积攒一定数量的卡牌才能与天梯主流玩家同台竞技，获得完整的游戏体验。 3.创建新账号需要重新投入资源，不像实体tcg可以卖掉卡牌套现。 可以看出对于老玩家而言，从炉石入坑影之诗或者双修，意味着从头开始肝/氪金来积攒卡牌。卡牌游戏本就烧钱，许多人无法接受这样的额外成本。（暂且不考虑游戏风格的适应问题） 炉石14年公测，影之诗整整晚了两年。考虑到国际服需要vpn/外服ios账号才能玩，实际的国服时间差要达到四年。而且国服和国际服的数据和进度都是不互通的，又造成了玩家内部的分化。 影之诗的福利比炉石好太多，初始就送30多包，但仍然难以填平昂贵的入坑成本。 炉石传说最弱的任务牌是哪张？ 2019.9.20 起手必定少一张牌，与套牌核心思路矛盾的： 鱼人总动员（萨，安戈洛）：鱼人萨本来1费曲线就弱，带任务就更容易一费空过，然后全面崩盘。 拉卡利献祭（术，安戈洛）：大乱斗版本之前弃牌术一直是极限快攻的代表，无限3/2看起来很美，然而快攻追求的是尽快斩杀。 激活方尖碑（牧，奥丹姆）：用环刷治疗然后技能接翻倍看起来很美，但心火牧真的亏不起这一张牌。 缺乏成熟构筑形态的： 湿地女王（猎，安戈洛）：人们过了好几个版本才意识到任务猎不是快攻而是组合技，然后彻底放弃将它带进主流构筑，即便是猎人最imba的版本。 侵入系统（战，奥丹姆）：暂且不谈和砰砰技能冲突的问题，要最大化刷新技能就要带很多武器，然而战士在标准压根就没有围绕武器的体系。 洗劫天空殿（法，奥丹姆）：奇迹法控制法宇宙法，主流形态没有一个带任务的。 任务奖励偏弱，不能一锤定音的： 最后的水晶龙（骑，安戈洛）：安戈洛版本毫无疑问的最弱任务，对面有一万种方法解掉嘉沃顿。在收获了炎伤佐拉敲钟永恒祭祀等乱七八糟的加强之后，依然难堪大用。 丛林巨兽（德，安戈洛）：类似口袋银河，牌库里的随从减费之后需要一张张抽上来才能发挥作用。好在451和橡树的召唤让它成为了蓝龙德关键组件。 最最伟大的考古学（术，奥丹姆）：抽牌减费的技能很强，但一回合只能用一次，还不一定抽到key牌。更何况抽20张牌的前置条件已经及其拖沓了。","link":"/2020/04/26/%E7%82%89%E8%BE%B9%E6%BC%AB%E8%AF%9D/"},{"title":"怎么评价「入关学」？","text":"近两年有个网络热词“舔狗不得house”，入关学可以说是它的键盘政治翻版。 二者的内核极为相似：一切努力为了争取话语权、主导权，而非乞求他人的认同。无论“他人”自身实力多么强大、许诺的利益多么诱人，一旦交出真理的解释权，唯其评价马首是瞻，那只有一种下场——死得毫无尊严。 沿着这个思路发散，可以发现入关学的走红也顺应了时代背景：80~90年代出生的年轻人是在长辈的责备下成长的。喋喋不休的唱衰可以理解成逆耳忠言，但更多是出于对上一代价值观病态的执念，换句话说就是挖空心思证明“年轻人不行”，最典型莫过于《夏令营里的较量》。如今，他们瞧不起的下一代纷纷步入社会，若要真正跻身主流，亟需重拾自信心，找到清算家长遗毒的理论武器，恰好入关学应运而生。 从某种意义上，入关绝非单纯的键政黑话，它可以是一种人生哲学——打破“努力必有回报”的幻想，逼迫你在战略层面重新反省，心甘情愿给别人做牛马到底值不值？ 至于饱受诟病的滥用（或者说鼓吹侵略）问题，入关本身建立在精心构建的背景下：围绕世界主导权与有限的地球资源，中美之争不可避免。入关的主动权也不在我们，这两年冲突加剧，“山海关”正在往我们脸上撞！在确凿的现实面前，把“等死，死国可乎？”打成穷兵黩武无异于为敌人拉偏架。 何况键盘政治天生就不具备实践性。哪怕学到的99%是糟粕，其现实危害也不会比@寒冰射手曹草草鼓吹的尼噶道之流更大，后者切切实实有着瓦解当前婚姻制度的倾向。 阅读原文","link":"/2020/04/02/%E5%85%A5%E5%85%B3/"},{"title":"【辞旧迎新】炉石历年新年计划回顾","text":"本文首发于旅法师营地，修正了一些不准确的地方，并增补了2020年的新内容。 盼望着，盼望着，大新闻叒来了，炉石新的一年的脚步近了。 经历了巨龙年的高强度整活，营地老哥的胃口想必已经被吊得很高。偏偏2020年也噱头十足，尚未抛头露面就已经被冠以炉石2.0的名号。 辞旧迎新之际，不妨回顾一下Team5每年都发布了些啥： 2016 海怪年 标准模式构筑！更多套牌栏位！炉石传说即将迎来全新玩法 专访Ben Brode：为什么炉石必须走出这一步？ 对于全世界的炉石社区而言，2016.2.3注定是载入史册的一天，突然公布的新年计划引发了轩然大波。 蓝贴内容主要包括以下三点： 确立标准模式与狂野模式，旧卡定期被轮换出标准卡池。 基础与经典卡的平衡性调整 套牌栏位从9个增加到18个 三分之二的内容是拿老玩家的核心利益开刀，而退环境的利弊又无法预知，因此整个社区陷入了极度的愤怒，几乎无法正常讨论游戏本身。如果当年营地的踩文化成型，那海怪年的改革将毫无疑问荣登第一名。 除了内容过于劲爆，社区炎上的另一个原因是消息快得猝不及防。新消息的发布毫无征兆，一夜之间变天的心理落差让许多人难以接受。显然Team5吸取了这个教训，此后几年的发布收敛了很多，也更注重和玩家沟通了。 顺带一提，最初的标准答疑帖明确说不会显示狂野排名，设计师还是做了一定的妥协： 我的战网好友看到的是我在哪种模式下的排名？你的战网好友只能看到你的标准模式排名。你们会分别列出标准和狂野模式的前100名排位赛玩家吗？目前我们只计划显示标准模式的前100名玩家。 2017 猛犸年 势如猛犸的一年！2017年炉石传说发展计划公布 Yong Woo韩国答疑会，谈炉石的过去现在和将来 第二年的计划如下，这次至少喜忧参半了： 设立荣誉室，将经典卡移入狂野模式 一年三个扩展包，每个版本附带免费冒险模式 狂野模式官方比赛 炉边聚会 新年登录奖励，包括盗贼新皮肤 荣誉室的出现显然是在打“经典卡永远不退环境”的脸。但换个角度想，“以退代削”总比每年折腾一轮经典好，甚至不分卡也能返尘，因此玩家们的反弹远不及去年。此外初版荣誉室唯独漏掉了基础卡，平衡起来除了削弱别无他法。冰封王座的补丁一次性削弱了小斧子激活和呱，日后还有臭名昭著的13.2补丁等待着玩家。 （13.2补丁 指拉斯塔哈大乱斗版本的二期削弱补丁，涉及火舌冷血生平等多张旧卡） 而扩展包改制则远远不止公布的那么简单，一年里陆续实装的改动有双职业橙（安戈洛）、十包保底（冰封王座）、出橙不重复（冰封王座）、新版本免费送橙（狗头人），可以说整个游戏的经济系统都被重塑了一遍。尽管构筑逐渐向以橙卡/紫卡为核心演化，造价水涨船高，但是集卡效率的提升使得游戏体验比前两年高出了太多。 剩下就是纯福利，狂野世锦赛和炉边聚会都落实的很到位。 （国服炉边聚会2019年才开放，但至少找机会把小萝莉皮肤发了） 2018 渡鸦年 炉石公布渡鸦年海量重磅消息：荣誉室新成员和锦标赛模式 Ben Brode对渡鸦年新闻的补充解释 猛犸年的成功给人一种炉石蒸蒸日上的感觉，新年计划也基本沿袭去年： 第二批经典卡加入荣誉室 游戏内置锦标赛 日常任务降低难度、增加收益 新年登录奖励，包括德鲁伊新皮肤 很不幸，最吸引眼球的锦标赛跳票至今，一年之后宣布无限期搁置，甚至被网易的插件领先一步。 其他内容乏善可陈，值得一提的可能是熔核巨人开了退环境回调削弱的先河，算是“以退代削”的延续，不排除今年再来一次。日常任务的改动思路也沿袭至今。 （上面这段写于2020.2.26，一周多后果然宣布回调10张卡，预言成功！） “失落的一年”或许从一开始就舍弃了进取心。 2019 巨龙年被奇偶双雄禁锢的环境加上粗暴的平衡补丁，炉石再次被推到了悬崖边，大家都期盼着改变。 在总结蓝贴之前，先谈谈今年出现的新事物：年度峰会——暴雪特邀媒体和圈内名人前往总部体验新版本。 正式公布之前谣言四起，瓦娘暗示“抓紧时间玩奇偶”，某个公众号甚至在B站玩起了猜谜，总之“炉石要有大新闻”已经深入人心。 炉石公布巨龙年海量重磅信息：荣誉室 炉石公布巨龙年海量重磅信息：竞技场，卡背及更多 至少从数量看，最后公布的消息确实没有辜负期待： 荣誉室扩容，首次加入非经典卡 竞技场引入轮换牌池，计入天梯胜场 冒险模式回归收费，内容大幅扩张 随机卡背、智能组牌 新年登录奖励，没有新皮肤 大头还是在荣誉室与冒险上，福利部分基本可以忽略不计，赛季皮肤都没有了。 荣誉室定义扩大，奇偶提前退环境，可以看做不惜再次打脸也要打破环境僵局。从后续的暗影崛起中期补丁两张基础卡退环境，可以看出之前的操作绝非狗急跳墙，而是有预谋地改变荣誉室的定位——从仅在年初例行枪毙几张经典卡，变成了面向全体标准卡的常备应急手段。 这种从保守趋于灵活的思路贯穿巨龙年全年。机械崛起、古墓怪谈、酒馆战棋。强调内容多样性而非拘泥于绝对平衡，这种思路无疑是一种进步。然而新一代设计团队的水平局限性不小，从大闸蟹到异变野兔低级错误不断，希望他们能及时吸取教训。 另一项重大举措——付费冒险回归有点出师不利。达拉然大劫案造势震天响，结果留下一句“堪比杀戮尖塔”的笑话。抛开与宣传的落差，两个地下城的可玩性基本是合格的，但这个模式本身在渡鸦年就已经透支干净了。相比之下年底的迦拉克隆觉醒还是有点惊艳，首次在扩展包后追加新卡DLC。卡池越来越深的情况下线性关卡也难以玩出花样，但是能解锁新卡绝对不是坏事。 由于笔者很少玩竞技场，轮换牌池的影响不予置评，似乎这个模式的生命力正在不断被酒馆战棋挤压。 2020 凤凰年与往年一样，2020年的炉石峰会在2月中旬召开，这次造势更为夸张，“炉石2.0”“定义十年内的玩法”均出自参会者之口。 到了3月初，又来了两点新的消息，其一是官网不小心透露了新年的Logo——凤凰；其二是正式公布即将回调十张卡的消息，要知道炉石历史上增强是屈指可数的。 炉石外服官网或泄露新炉石年主题 Iksar透露狂野回调卡牌数量和分布 如何看待暴雪透露炉石传说将回调十张卡牌？ 在这之后呢，就是无尽的长草期，酒馆战棋补丁很勤，但新年资讯完全没有。到了3.11，官方终于公布了预告的预告——3.18开发布会（远远晚于往年），并配上了神秘兮兮的“Storm is comming”，而玩家早已被这种挤牙膏行为气的跳脚。 However，等到“除夕”3.17，一家外国媒体突然提前发布了爆炸性的消息： 炉石新年计划偷跑前瞻：新扩展包、新职业、牧师大改 不久之后偷跑的消息得到了营地与nga等媒体的确认。按照营地的说法，上述足以匹敌往年整个计划的内容，可能只是冰山一角（15%）。发布会当天，他们足足用了八个版面才囊括了所有内容： 炉石公布凤凰年新闻（一）：开包机制改革 炉石公布凤凰年新闻（二）：炉石第十职业——恶魔猎手 炉石公布凤凰年新闻（三）：荣誉室（中立部分） 炉石公布凤凰年新闻（四）：牧师基础和经典卡重做 炉石公布凤凰年新闻（五）：削弱卡牌回调 炉石公布凤凰年新闻（六）：酒馆战棋更新和通行证 炉石公布凤凰年新闻（七）：天梯及其他系统模式 炉石最新版本公布：外域的灰烬 新职业与平衡性改动的影响 一时半会看不出，只能简要从玩家盈亏的角度分析一下： 与影之诗的解决方案相似，新职业恶魔猎手在今年的每个扩展包占据额外的卡位。可能为了弥补卡池稀释，开包不重复将推广到所有稀有度，使得通过预购凑齐蓝白卡更加容易。而归入巨龙年的“经典卡”则是免费赠送的。可见设计师希望人人都能玩上新职业。 而对回归玩家（包括全新账号）赠送一套卡组简直是逆天程度的福利，堪比风暴2.0的英雄大礼包。每个预组造价约6000尘，约等于15包/60rmb，而且卡牌归入收藏可以任意支配 。如果说威兹班是萌新救星，那么这次的免费预组则一步到位让他们能和天梯主流选手同台竞技，而非用着低配套牌被守门员吊打。 说到天梯，每月奖励和段位制度也迎来了重做。新版本的低保（钻5）奖励为7张蓝卡+4包，开出至少一张紫卡才能超过目前版本。而段位重置则各有利弊，月初一律重置到青铜10，不像以前上月打到1级下月保送5级，哪怕有10星奖励也要多打好几把才能拿低保。相对而言冲击传说稍微简单了一点，距离最近的保护段只有15星。 另一项有争议的改动是酒馆战棋通行证，充钱享特权让很多玩家想起臭名昭著的三国杀online。当前版本解锁第三个选将&amp;数据统计需要购买20巨龙包 ，也就是2000金币 ；而单独购买新的通行证则需要2500金，外加四张竞技场入场券。看上去差别不大，然而前者实打实地按市价开包，后者的1900金只能用在战旗上，要想不“浪费”只能用人民币预购每个新版本（还是最贵的488）。玩家终究还是亏了，至少“双修”构筑与战棋的代价会更大。 值得一提的是今年的首个扩展包与新年计划的发布合并，并且《外域的灰烬》预览季即刻开始，打破了猛犸年以来发布会之间有数周间隔的惯例 （但外域包上线的时间相比往年变化不大）。此外今年剩余阶段的计划也一并发布，画了史无前例的大饼：新模式、成就系统、还有神秘内容，通通comming soon！ 阅读原文","link":"/2020/04/02/%E7%82%89%E7%9F%B3%E6%96%B0%E5%B9%B4%E8%AE%A1%E5%88%92/"},{"title":"炉石凤凰年主题曲《Pheonix》","text":"新版本MV太短？那就自己整一个，主题曲都是现成的！ 视频素材：《奥丹姆奇兵》《巨龙降临》《外域的灰烬》及恶魔猎手官方宣传片 BGM：英雄联盟S9主题曲《Phoenix》 剪辑工具：Adobe Premier（水平有限请见谅）","link":"/2020/03/25/phoenix/"},{"title":"如何看待暴雪透露炉石传说将回调十张卡牌？","text":"今年的长草期实在有点长，不妨先盘一盘潜在的回调对象，至少先排除一部分单卡。 巨龙年 可以看到绝大部分是在巨龙降临版本期间削弱的。这些卡还要在标准待一年，因此首要考虑的是对标准的影响。 怪盗恶霸 ，咒术师的召唤 巨龙降临之前的削弱，削弱之后它们的表现相对稳定，没有必要回调。 红龙女王阿莱克丝塔萨 ，海盗之锚 ，废墟之子 ，无面腐蚀者 ，邪鬼仪式 和上面的幅度差不多，把op单卡砍到一般强卡的水平（红龙等于没改），可以回调但没必要。 至于设计师为啥专门关照JK术，我也不知道。3费邪鬼仪式一点都不出格，冒险也没有补强。 堕落的元素师 ，巨龙的兽群 ，霜之祈咒 JK萨无人生还，一刀入土。前两张确实无脑强，可能就霜之祈咒有可能回调，蛙灵泽蒂摩都退了。 淤泥吞食者 ，魔古血肉塑造者 萨满惨遭腰斩的节奏组件。734和突变的combo明年不退，基本告别回调。 小鱼人就有点矫枉过正的意思，作为重要的1费曲线砍完还不如中立卡。鉴于鱼人和过载体系在巨龙年都有为数不少的补强卡，回调的可能性相对较大。 死金药剂师 踩了低费超展开的雷区，996+低费冲锋还能空场斩杀， 不过我觉得狂野未必容不下这种combo，明年没准就回调了。 档案员艾丽西娜 削弱的理由是控制内战8+2无脑拖疲劳不健康，但是这种现象对天梯的影响非常有限，反而备牌赛制下冗长的消耗战观赏性极差。现在备牌赛制和银行家（沙德沃克）都没了，回调也在情理之中。 渡鸦年 毫无疑问，砰砰博士和鲁莽的实验者已经提前预定了两个名额。前者削弱是弥补标准英雄牌分布不均的权宜之计，后者削弱纯属为大铡蟹这种拍脑袋产物背锅，回调天经地义。 剩下四张牌或多或少跟组合技沾边，只能选两张相对安全的。参考了一下狂野职业热度，个人倾向于增生手臂和团伙劫掠，毕竟心火牧/海军贼已经T3开外了。 狂野模式 范围实在是太大了，而且难以揣测设计师到底希望狂野环境怎么变。只能慢慢分类排查： 艾维娜，巴内斯，纳迦海巫，海盗帕奇斯，缚链者拉兹 以上是专门针对狂野模式作出的削弱，已经送走的毒瘤显然不可能再请回来。 这里着重提一下人气爆棚但“未退先削”的帕奇斯和拉兹。0费的森然巨化足以把帕奇斯的冲锋一票否决，而拉兹的情况就比较复杂。受制于过牌手段与构筑限制，宇宙牧凑齐58启动的速度要远远慢于奇迹法至暗术等主流组合技卡组。但是不得不承认，在足够深的卡池下0费技能有着无限可能，DK上线之初就盘活了一堆逗比激励卡，现在甚至可以照搬手速牧刷实验体，迟早会进化出“任务宇宙龙法”一样超出当前认知的形态。总之不看好拉兹回调。 暗影打击装甲，恐惧战马 削弱原因并非强度，而是和新卡之间的结算产生循环。游戏基础机制不变的情况下没有回调的必要。 其余的单卡削弱原因都是在标准强度失衡，但回调与否肯定不能再放在当初的环境下评价。 现在狂野的主旋律是“赛马”，也就是尽快凑齐核心单卡进行超展开。那么先看一下组合技单卡： 探索地下洞穴，着魔男仆，黑暗契约，萨隆苦囚，吸血药膏 萨隆苦囚如果回调一点问题都没有，引发削弱的沙德沃克复制体系在狂野一文不名，更何况本来就有魅影歹徒之类的替代品。 魔块术的两张也是如此，数值低的离谱，现在的狂野魔块术已经弃用了它们。考虑到回血对术士很宝贵，可能男仆回调的概率大一些。 吸血药膏有些微妙，爆牌贼在弑君问世到药膏削弱期间始终没到imba的地步，伺机待发还削弱了。狂野盗贼该不该有治疗有待商榷，至少它不会和团伙劫掠一起回调。 任务贼在绿字变白字以后处于很尴尬的境地，基本告别构筑。但考虑到其机制与低费卡联动的危险性，设计师应该不会继续折腾它了。 尤格-萨隆 单独拿出来的原因是它和组合技卡组的思路是相悖的，越是追求明确制胜手段的卡组越不可能带这张逆风时放手一搏的卡，能用上它的大概只有无限战之类的娱乐卡组，回调相对比较安全。 回调还有一个好处是与沙德沃克苔丝等其他导演保持一致。当初削弱的时候“死亡后战吼中断”并没有写在卡面上，这可能会让没有经历过海怪年的新人误解。 盘完组合技，最后剩下中速/节奏组件了 战斗号角，等级提升！，蹩脚海盗，通道爬行者，骨魇 相对出格的单卡。削弱前的战斗号角是任何中快速骑士的构筑核心，让佛祖焕发第二春，其过滤牌库的效应甚至可以被元气骑等控制卡组利用。 （所谓出格就是排除回调可能的意思） 等级提升和军需官同时满编看上去能显著增强奇数骑的中期能力，但目前环境下效果存疑，暂且放在这一栏。 剩下三张中立卡在节奏卡组里也能大杀四方，尤其是奇数双雄。 恶毒的召唤师，兽群呼唤，法术翡翠，海象人图腾师，幽灵之爪，传播瘟疫，送葬者 相对笨重一点的单卡，在标准叱咤风云但在狂野强度正常，回调相当安全（或许8费三宝可以盘活偶数猎呢）。 最终预测名单12345淤泥吞食者“科学狂人”砰砰博士，鲁莽的实验者，增生手臂，团伙劫掠尤格-萨隆，萨隆苦囚，着魔男仆，兽群呼唤，恶毒的召唤师 阅读原文 发在营地的版本","link":"/2020/03/08/%E5%B7%A8%E9%BE%99%E5%B9%B4%E5%9B%9E%E8%B0%83/"},{"title":"如何看待湖北一线医务人员子女参加 2020 年中考加 10 分录取？值得推广吗？","text":"这项政策不该理解成“奖励”，它更像是在给紧急征召善后。 疫情一日不解除，医务人员就一日不得回家，其子女相当于暂时失去了一位家长。 家长不在家有多可怕呢，前几天看到这样一条新闻： 据悉，爆料人韩女士是一名护士，最近奋战疫情一线，丈夫又在外地，10岁儿子独自在家用手机上网课，不料偷看抖音直播，3天给一主播刷近10万礼物。2月25日消息，抖音在其官方微博发布声明称，经查实，抖音平台已对相关用户进行全额退款。 这条新闻起码暴露了两点问题： 其一是家长缺位的程度比想象中严重，双亲有一方被征召，另一方一旦出差或者工作繁重孩子几乎没人管了。 其二是离开家长照顾的儿童人身安全堪忧，偷偷充钱至少还能通过法律讨回，换个方式作死恐怕就就不可挽回了。 除了生活自理成问题，还要为父母是否能平安归来而忧虑。在这种家庭条件下安心复习是及其困难的，偏偏现在学校停课帮不上忙。 考虑到上述的背景，不难推断出一线医务人员的子女因疫情而家庭动荡，无故受害。加分旨在让他们能够和其他人同台竞争，而非锦上添花的“父荫““特权”。 高赞等很多人从“公平”的角度来质疑这项政策： 首先，你得是一线医务人员；其次，你得有子女；最后你的子女还得参加2020年的中考。100个一线医生符合条件的有几个？ 然而首当其冲的恰好是“符合条件的”应届初三/高三学生，其他年龄的子女学业影响相对轻很多，也就没有必要专门补偿（换句话说中高考本身很敏感，加分对象能精则精）。 鉴于这是一条针对新冠疫情的临时善后政策，不值得在和平时期推广，同时对一线医务人员的普适性奖励应当及时落实。 阅读原文","link":"/2020/02/28/%E7%96%AB%E6%83%85%E5%8A%A0%E5%88%86/"},{"title":"为什么有很多人喷《原神》抄袭《塞尔达》却没有人喷《赛尔号》抄袭《宝可梦》","text":"原问题是《赛尔号》，第二天被改成了《temtem》 为什么有很多人喷《原神》抄袭《塞尔达》却没有人喷《赛尔号》抄袭《宝可梦》？ 很有意思的问题，按照时间线捋一下不难得出答案： 口袋妖怪和赛尔号争得最厉害的时段是2010～2012，也就是四代末五代初。由于众所周知的原因，绝大部分人沿袭了三代的模拟器+汉化rom的习惯。 同样是“免费游戏”，口袋妖怪只能在极不成熟的nds模拟器上体验单机剧情（当然心魂黑白本身的素质毋庸置疑），而赛尔号操作简单、自带中文、还能在线社交与PVP，对于低龄玩家而言无疑是一盏明灯。靠着一点关键的微创新，赛尔号从口袋玩家里分化出了最初的基本盘。 玩家群体的重合度较大自然容易打起口水仗，锑尔号吧就是在这个时间段建立的。由于口袋动画漫画情怀拉满，赛尔号仿的粗制滥造，舆论可以说是一边倒。但因为当年玩家年龄偏小以及发言渠道有限，论战以恶搞性质为主，和今天的游戏圈撕逼相比简直是过家家。 2013年XY发售，破解和模拟器的缺失意味着想玩新作就得老老实实出钱买3ds和卡带。从这一刻起，实机党和模拟器党彻底分道扬镳，前者掌控话语权，后者沦为遗老。 新一届口袋玩家和赛尔号玩家可谓是毫无交集的两个物种，加上实机带来了一些模拟器做不到的全新玩法，比如孵蛋GTS和线上排位赛，忙于游戏本身自然没有精力去开喷。至此双方的战争告一段落。 到了2015年，赛尔号受到王者荣耀等同生态位的手游的冲击逐渐式微，但对口袋玩家而言反而是最敏感的时刻，两家第一次产生了利益冲突——中文化请愿。 ”八国语言没中文”的原因众说纷纭，但是盗版游戏始终是绕不过去的一道坎。从gb/gba时代的盗版卡带到今天明目张胆挪用七代素材的“复刻”手游，中国从来不缺想薅这个ip羊毛的奸商。请愿书一经发出，也意味着正版玩家向盗版与山寨全面宣战。万幸的是以赛尔号、洛克王国为首的山寨游戏已经凉的恰到好处，其他小山寨商虽然侵权更狠，在曝光渠道上无法与淘米和腾讯相提并论。本该爆发的尖锐冲突，在历史的巧合下悄然化解了。 如果赛尔号依旧有巅峰期的热度，或是请愿稍有差池，恐怕斗争烈度不会亚于主机玩家围剿《原神》。 2016年初，随着《精灵宝可梦 日月》公布，中文化请愿顺利上岸。宝可梦迷普天同庆，也失去了最后一个与赛尔号敌对的理由，谈论它也不再是禁忌，甚至可以当成自嘲的素材（比如把闪焰王牌和雷伊盖亚P到一起）。随着玩家年龄的增长，赛尔号的口碑终于从拿不上台面的国产寨游扭转成了珍贵的童年回忆（甚至有了怀旧服），虽然无法与常青的“原作”相提并论，也算是落得善终。 至于2020年的《temtem》，受益于六七世代的培养，以及NS较高的普及率，国内已经有了高度成熟的正版宝可梦环境。同时剑盾砍图鉴让Gamefreak的声望跌至冰点，玩家们迫切地希望能有挑战者出现改变本家不思进取的现状。在这种时代背景下 ，不难解释对一个高度借鉴的游戏采取宽容而非敌视的态度。 阅读原文","link":"/2020/02/19/pokeseer/"},{"title":"如何评价《正义联盟》开场曲《Everybody Knows》？","text":"可能是我听过最有内涵的英文歌曲。 Like their father or their dog just died 初看似乎是为《正义联盟》量身打造，连超人养父舍身救狗的细节都安排上了。然而原曲发行于1988年，虽然它与正联的开场蒙太奇堪称天作之合，但这首曲子绝非单纯的电影附属品。 或许是因为“缅怀英雄”这个题材永不过时，其中的一些内容放到今天（2020年初）依然振聋发聩： And everybody knows that the Plague is comingEverybody knows that it’s moving fastEverybody knows that the naked man and womanAre just a shining artifact of the pastEverybody knows the scene is deadBut there’s gonna be a meter on your bedThat will discloseWhat everybody knows 请各位细品，这种时候中文翻译反而显得苍白无力了。 1注：扎克·斯奈德的导演剪辑版《正义联盟》预计于2021年初上映，届时可以重温一遍经典。 阅读原文","link":"/2020/02/09/everybodyknows/"},{"title":"2010-2020","text":"最后の10‘s 生きてるFull speedNow I know I wanna start to move to the rhythm 过了零点，新的年代就正式开幕了。为了日后怀古的时候不至于无从回忆，特此写一篇流水账，记录一下过去十年里亲身经历的变迁。 一说到“变迁”，首先从社交网络谈起。在2010年我注册了第一个贴吧账号，在这里完成了作为网民的启蒙。曾经的华语第一论坛包罗万象，从化学到植物大战僵尸都有专门的讨论区，不仅能分享干货更能谈天说地。贴吧记录了我的兴趣爱好足迹很长时间，近两年才因为广告和恶劣的讨论环境不得不放弃。 2013年第一次拿到智能机，又发现一片新大陆——QQ空间。翻翻“那年今日”，高中三年的点点滴滴历历在目，夹杂着各种非主流段子和矫情的小作文，现在看着忍俊不禁，但当年乐此不疲。现在的空间充斥着营销号和锦鲤，连转发保留右边的功能都没了，早已失去了灵魂。 接触知乎要等到2016年，虽然开放注册后不再自诩高端，但机制和内容均全面优于贴吧。现在我有什么想法会首选发在知乎上，当做博客来使用。除此之外我的手机上还常备旅法师营地和NGA两个游戏社区，以及逐渐取代QQ的微信。 网页时代社交网络还只是周末放学后的消遣，各种app的出现则彻底把生活与网络绑定。只要手机充了电，就能随时随地刷5~6个社交app，无时无刻沐浴在海量的信息中，皇帝批阅奏折的比喻已经过时了，这根本就是口袋中的宇宙！当然虚拟终究取代不了现实，手机玩多了荒废时间不说，思维容易被种种不切实际的论调所误导，做人还是脚踏实地为妙。 二不仅是社交网络，世间万物都在悄然蜕化，无论是否有迹可循。 我们熟知的“新四大发明”共享单车，十年前就在社区里见过雏形，但只能原地还车，而且租车卡需要专门到区政府申请，和扫码解锁随地启停的“现代版”相比等于没有实用性。《英雄联盟》也同样于十年前问世，此时WCG已经办了差不多十年，但人们依旧把它看成游戏高手打架而已，谁能想到一个后来者能做出完善的联赛体系，把电子竞技往体育的方向发展？ 上面的例子或许属于技术进步的必然，而人生轨迹的变化是难以预料的。 如果回去告诉十年前的自己以后会考进实验和同济，还能搬进100多平米的新家，他多半觉得这是痴人说梦。换做五年前，大概会是“好遗憾，去不了上海最好的大学了”。 关键的拐点发生在2012年下半年，此前我的成绩下滑很严重，但是在离中考不到一年的时候逐渐发力，一路高歌猛进拿下了实验的预录取资格。进了重点高中，依旧没有懈怠，紧追各路学神的步伐，收获了一个基本满意的结局。与此同时，父母比我更加努力，如今家里的物质条件与十年前相比可谓天壤之别，实在是难以用言语表达感激之情。 一个人的命运，当然要靠自我奋斗，但也要考虑到历史的进程。 三很不幸，“人缘”从来不是我的强项，因为任性而不知分寸的举止得罪过的人数不胜数。但这并不意味着一个知心朋友都找不到。下面这场21世纪十年代的奇遇，发生在我和Vicky妹子之间。（为啥叫Vicky？因为是我帮她取的英文名） 初三的时候报名了精锐1对1补习班，在那里和这位女孩子相遇。我们碰巧在同样的三位老师门下上课。那时也只不过在课间多聊几句而已。 中考结束后，补习班的几个同学相约一起出去玩，我和她坐上了锦江乐园的摩天轮（迄今为止唯一一次）。 不久成绩出来了，我去了浦东而她留在徐汇，本以为从此不再会有交集。直到高一的寒假，我在家里接到了她的电话，至此总算建立起稳定的联系。 虽然住址和学校都相隔甚远，但我们的关系反而越走越近。从偶尔在QQ上嘘寒问暖，到共享一个Apple id，暑假里约书展和咖啡厅。到了高三更是无话不谈的程度，每晚都能收到她的消息。按照她的说法，比起朋友更接近于家人了。 高考之后，她去了杭州的一所大学，开始了新的生活。最后一次见到她是在9号线九亭站，正好是18岁生日的后一天。此后我们渐行渐远，仿佛无事发生过。 人与人之间的引力就是这么奇妙，哪怕是一点微乎其微的摩擦，也能勾勒出彼此交织的优美曲线，然后在一个意料之外的时间点回归成两条陌生的平行线。同一个十年里类似的奇遇并不少，换一次座位都能发展出故事。无论是过去完成时，还是现在进行时，只要能回味出幸福便足矣。 四“不知庐山真面目，只缘身在此山中”。正是因为未来的不确定性，我们在回溯过往时觉得十年一下子就过去了，往前看却是以天为单位缓缓度日。好在我们依旧有机会决定往哪里走，哪怕满眼都是迷雾。 美好的时光总是有限的。过了零点，下一个十年已经开始倒数。无数个十年之后，我们的生命将不可避免地迎来终结。意识到这个问题，或许余生都无法尽兴享受。然而正如哭解决不了问题，恐惧也无法违抗时间的流逝。我们能做的，只有发挥主观能动性，在终结来临之际尽量不留遗憾罢了。 发在知乎的版本","link":"/2019/12/31/2010-2020/"},{"title":"玛丽苏神作《紫色摩天轮》","text":"有哪些顶级的玛丽苏小说？ 《紫色摩天轮》，整整111章，显然不是恶搞玛丽苏的玩票作品。 海量的人物，奇特的世界观，不可多得的神作。 先来看看这本小说大致长什么样： ​ 人物简介（可跳过） 舒雅优：16岁，容貌绝美，性格令人捉摸不定，是世界排名第一的星家失踪了11年的独生小姐——星晴静儿，5岁被人绑架，6岁被紫家收养，取名紫桐，几乎全能，带着一张紫色银玫瑰的半脸面具，是冰舞界天才——紫冰澈公主，音乐界天才——紫茗公主，并且还是世界第一帮派暗夜帮帮主——紫冥公主，左耳戴紫色曼陀罗耳钻，右耳戴紫色玫瑰耳钻，10岁就读完了世界最顶尖的10座大学，成为了那些大学的博士生，学位非常高，打架时最常用的跆拳道是最高级，其它武术基本全都是最高级，被称为“完美公主”，智商高达297。 欧阳哲：17岁，帅气冷峻，性格冷酷，惜字如金，是星家旗下十二大家族之首，世界排名第二的欧阳家继承人，音乐才能与舒雅优不相上下，漠视一切，很会打架，被称为“音乐王子”，智商高达258。 东方寒：17岁，深情俊美，性格冰冷，不爱说话，是十二大家族之二，世界排名第三的东方家的继承人，擅长飙车，是舒雅优在赛场上的劲敌，目空一切，跆拳道级别为黑带六段，被称为“急速王子”，智商高达259。 上官晴：17岁，长相漂亮，性格搞怪，但是是师长眼中的乖乖女，是十二大家族之三，世界排名第四的上官家的长女，成绩优异，管理能力不可小看，但坐不住，擅长柔道，被称为“乖乖公主”，智商高达248。 上官熙宇：17岁，长相帅气，性格冷静，不常说话，是十二大家族之三，世界排名第四的上官家的继承人，头脑反应迅速，是上官晴的弟弟，基本不会笑，空手道级别最高，被称为“冷酷王子”，智商高达256。 蓝天：17岁，冷静帅气，性格沉稳，话不多，是十二大家族之四，世界排名第五的蓝家的继承人，擅长滑板，反应灵活，经济头脑非常发达，偶尔会笑，空手道级别略低于上官熙宇，被称为“冷瑟王子”，智商高达255。 蓝浩：17岁，冰冷帅气，性格冷漠，经常睡觉，是十二大家族之四，世界排名第五的蓝家的二少爷，擅长街舞，关节灵活，靠街舞俘获众多少女的心，柔道最高级，被称为“街舞王子”，智商高达251。 蓝扬：17岁，帅气慵懒，性格外冷内热，是十二大家族之四，世界排名第五的蓝家的三少爷，擅长游泳，爱玩极限运动，帅气的动作让众多少女为之疯狂，跆拳道黑带四段，被称为“极限王子”，智商高达249。 凌风：17岁，帅气搞怪，性格热情，爱与人抬杠，是十二大家族之五，世界排名第六的凌家的继承人，擅长跑酷，众多让人惊心动魄的动作和平易近人的特性让他女生缘最好，空手道级别与蓝天不相上下，被称为“热火王子”，智商高达254。 白紫夜：17岁，优雅帅气，性格多变，曾是舒雅优毫无血缘关系的哥哥，是十二大家族之六，世界排名第七的白家的继承人，擅长钢琴，他的优雅与帅气迷倒万千少女，但是跆拳道级别为黑带五段，被称为“优雅王子”，智商高达253。 南宫逸轩：17岁，温柔俊美，性格双面，是舒雅优的青梅竹马，是十二大家族之七，世界排名第八的南宫家的继承人，擅长冰舞，是舒雅优的冰舞搭档，空手道级别与上官熙宇同级，被称为“双面王子”，智商高达254。 夏梓潼：17岁，漂亮冷静，性格礼貌，是十二大家族之八，世界排名第九的夏家的继承人，头脑和才能让公司里的长老级董事自叹不如，曾在一个星期内让公司产值提高了26个百分点，超能打架，被称为“魅力公主”，智商高达246。 李婷：17岁，温柔美丽，性格随和，是十二大家族之九，世界排名第十的李家的继承人，外表柔弱的她其实精明干练，发狠的她曾一夜间毁掉八个国际公司，在公司是个女强人，柔道最高级，被称为“温柔公主”，智商高达245。 成璐：17岁，野蛮漂亮，性格刁蛮，是十二大家族之十，世界排名第十一的成家的继承人，平时虽然野蛮但是关键时刻非常认真，很善良，标准的刀子嘴豆腐心，柔道最高级，被称为“野蛮公主”，智商高达243。 水月瑶：17岁，聪明美丽，性格温柔，是十二大家族之十一，世界排名第十二的水家的继承人，是舒雅优的死党，暗中保护了舒雅优10年，非常单纯，但是在公司里毫不含糊，武术非常厉害，被称为“多变公主”，智商高达240。 陆思盈：17岁，可爱机灵，性格迷糊，是十二大家族之十二，世界排名第十三的陆家的继承人，是舒雅优的死党，在经济学方面反应超快，对于公司打理的顺顺当当，柔道也不错，被称为“迷糊公主”，智商高达240。 韩若星：17岁，泼辣可爱，性格搞怪，是世界排名第十四的韩家的继承人，是舒雅优在去英杰路上偶然帮到的一个女生，后成为舒雅优的死党，很会打理公司，很八卦，是英杰新闻社的社长，擅长柔道，被称为“搞怪公主”，智商高达240。 北冥言：17岁，帅气俊朗，性格冷漠，是世界排名第六十的北冥家的继承人，就读于英楚，后转进英杰，是舒雅优在英楚当交换生时认识的一个帅哥，擅长空手道，对自己认识的人才能敞开心扉，被称为“漠然王子”，智商高达197。 西门谦：17岁，帅气冷漠，性格淡然，是世界排名第六十一的西门家的继承人，就读英楚，后转进英杰，英楚5大校草之一，英楚学生会副会长，跆拳道级别为黑带4段，擅长收集情报，唯独对舒雅优较温柔，被称为“无情王子”，智商高达195。 任桦：17岁，帅气搞怪，性格热情，是世界排名第六十二的任家的继承人，就读英楚，后转进英杰，英楚5大校草之一，英楚学生会成员，典型的花花公子，换女友比换衣服还快，擅长打架，被称为“火蝶王子”，智商高达183。 苏伦：17岁，帅气可爱，性格羞涩，是世界排名第六十三的苏家的继承人，就读英楚，后转进英杰，英楚5大校草之一，英楚学生会成员，生气的时候非常可怕，很专情，很会打架，被称为“可爱王子”，智商高达194。 韩烈：17岁，帅气自恋，性格多变，是世界排名第六十五的韩家的继承人，与韩若星没有任何关系，就读英楚，后转进英杰，初中认识舒雅优，是舒雅优的小弟，誓死保卫舒雅优，擅长篮球，被称为“篮球王子”，智商高达190。 星彬落：19岁，俊美帅气，是星晴静儿的堂哥，全力辅佐星晴静儿接手公司的人，长期流连花丛，典型的花花公子，经常捉弄星晴静儿，是将来星氏企业的总经理，空手道级别很高，智商高达268。 星茂宇：45岁，冷酷睿智，非常谨慎，是星氏企业的董事长，是一个非常好的领导人。 星茂银：45岁，爱玩睿智，非常恋哥，是星氏企业的总经理，不喜欢涉足商海。 这个“可跳过”就很灵性，一般人看到开头又长又扯淡的人物介绍多半会放弃读下去。 人设如此不凡，那主要情节呢？这里引用另一个答主的回答： 内容是女主真的好优雅好有钱好不做作还会打架瞳孔还是紫色皮肤还会突然熠熠生辉喜欢踩着滑板上贵族学校的大美女。进校第一天所有男同学都爱他，大多数女生都嫉妒她不过没关系，爱他的男生都保护她。班级座位还是一种根据颜值还是家境来的一种阵法，女主正好坐中间。高冷冰山对女人不屑一顾的男主对她一见钟情，温柔如水。前半部分就介绍了女主怎么去贵族学校1 中间记不太清怎么回事，大概是女主被妖艳贱货所害，男主和一众男配们误会伤心离开贵族学校1，隐姓埋名(x)其实也就是换了个另一个玛丽苏的名字到另一个城市另一个学校去读书，刚进学校就有男配喊她老大，对她保护有加，新学校的男人们也都爱她，为她打架为她痴狂。 再后来不记得发生了什么，贵族学校1的男人们良心发现找到了女主，女主阴差阳错发展自己是贵族中的贵族，搞了一大堆奇奇怪怪的东西之后 ，男女主结婚了。 我实在数不清里面有多少个爱女主的男配 下面放几张图让大家感受一下。是结局 男女主在一起男配们的衷心祝福，划横线的都是男配 除了“女主有紫皮肤”这种笔误，上面说的基本属实：去贵族学院A（英杰）上学，经历了一大堆事情以后转学到贵族学院B（圣玄），再被男主们找回来。 主要人物自然是上面那25个大佬了。 英杰贵族学院：世界第一高等贵族学府，能进入这里学习就等于出来后将来是在各行各业中叱诧风云的人物，因此，众多贵族子弟想方设法想进英杰，但是只有特别优秀的人和特别有前途的人才能进去。终极一班：英杰最优秀的人组成的班级，每人的智商都在180以上，身家都在千万元以上，进了终极一班就等于进了真正的超上流社会。英楚贵族学院：一座优秀的学院，但由于与英杰同在一个市区内，就经常与英杰作对，但每次都以失败告终，世界四大高等贵族学院之二，每当英杰开除一个人就会帮他办转校到英楚的手续，即使那样，英楚也是很优秀的。圣玄贵族学院：一座优秀的学院，处于离英杰、英楚超近的B市，世界四大高等贵族学院之三，与圣幻同处一个市区，两个学校相处的很好，也是培育优秀人才的地方。圣幻贵族学院：也是一座优秀的学院，处于B市，世界四大高等贵族学院之四，和圣玄是兄弟学院，不像英杰和英楚那样明争暗斗，是还比较和平的两个学院，人才辈出。 但是！读完全本才发现，上面的情节只是个序章。 猜猜后面发生了什么？ 女主又跑到贵族学院C，blabla… 又去了国外的贵族学院D，blabla… 剧情跟前半篇基本没差，就是“X大校草”“XX王子”的数量不断增长。到最后结婚的时候差不多得有二三十个。而且这帮配角可不是一次性工具人，时不时就出来刷存在感。 至于书名，作者是这么解释的，深谙玛丽苏的精髓： 每个人的摩天轮都有属于自己的颜色，那是幸福的颜色。 她是拥有世界的公主，来自黑暗的王，可是把自己的摩天轮涂成了紫色，在别人看来生硬的颜色，在她眼里，紫色的摩天轮幻化出幸福的笑脸，每一个车厢里都有她和他的身影，这，就是紫色的幸福·.. 还有奇葩的文风，玛丽苏么自然是以爱情为主的，这小说不仅全程无H，连正经谈恋爱的镜头都没几个。绝大部分的篇幅都是校园日常、装逼和打架。“终极一班”之类的港台偶像剧设定随处可见，打架之前要报一下家族在世界上的排名，比一比智商数值。 阿虚说过，在虚拟世界里寻找真实感是脑子有问题，在《紫色摩天轮》里你甚至找不到一点真实感，魔幻得不像是发生在地球上。 再联想到不断累加宛如批发的男配，不难猜想这玩意是一群年龄较低的初中/小学生合作完成的。问题是有的地方又不像是小孩子的手笔，比如女主失忆的伏笔埋得相当流畅。 总之看玛丽苏就是图一乐，千万不要带上智商。而且《紫色摩天轮》相比堆砌烂俗套路的网文堪称清流。 顺带一提，续作《冷血女王的爱情保卫战》总算有点正常小说的模样了，但神作范儿依旧，比如铺天盖地的人名，儿戏一般的情节。 至于同一作者的其他作品水平如何，我们来看看《微笑泰迪熊:约定摩天轮》： 那一年，他十岁，她八岁。 他全家被一伙黑衣人杀掉，他却逃了出来，浑身是血的倒在了一片紫色薰衣草花田里。 “你，没事吧？”那样甜美的声音，让极度虚弱的他以为遇到了天使，他睁开眼睛，看到的，是一个穿着紫色公主裙的小女孩，手里抱着泰迪熊，洁白的脖子上戴着一串摩天轮项链。 …… “等等。。。。。。”他想挽留她，却终究没有喊出来，她已经跑远了，失落，再次填满了心，垂下眼帘，地上一个闪闪的东西却刺痛了他的眼睛。 那是什么？他疑惑的想，不由自主的伸出手，拿起了那个东西，是那条摩天轮项链，她脖子上的！他把那条项链，连同那个绝美的笑容，深深地珍藏起来。 “给我七年，把世界都给你！”他对着那个背影，许下一个承诺。 等待着，再次遇见的那一天。。。。。。 很正常的言情小说起手，再看下一页： “哥，我真的考上圣丝学院了！” 别墅花园里，我抱着哥，开心的跳着，挥舞着手里的录取通知书，这一刻，就连空气中也弥漫着快乐，我冷映舞，终于考上梦寐以求的圣丝学院了！ “小舞，不要这么激动，早都说了，以你的智商，闭上眼睛都考得进去的！”哥微笑着点了点我的鼻尖，宠溺的眨了眨眼，温柔的说。 … 冷枫泽正想回答，手机却不识相的响了起来：“只是还没告诉你，对不起我爱你，就算有一天。。。。。。”他立刻拿出手机，慌忙离开了花园：“幻。。。。。。” 听到那个字，我皱眉：幻？秋晨幻吗？那个紫影门的操控者？怎么会认识哥哥的？据说，他也在圣丝学院，可是，他不是和我一样，早已经读完了博士后学业吗？难道他和哥哥是在学校认识的？但为什么哥从来没有提过呢？还有，哥掌握着蓝空门，到底和秋晨幻有着什么千丝万缕的联系，那个冰山一样的男生怎么可能允许一个正像滚雪球一样发展壮大的帮派威胁自己黑道老大的位置？而且，黑道四大天王，真的像小叶给我的资料一样，都潜藏在圣丝吗？那，世界前四强的企业和帮派岂不是都被掌握在秋晨幻的手上？紫影、蓝空、黑荷、白魄，再加上我的紫熏，这五个生活在传说中的集团和帮派，还有被称为五大至尊的我们，真的会产生交集吗？ @#$%^$%&amp;*！ 每篇小说都是这个调调，真有你的。","link":"/2019/11/15/%E7%B4%AB%E8%89%B2%E6%91%A9%E5%A4%A9%E8%BD%AE/"},{"title":"如何评价《我们为什么要警惕电竞狂热》？","text":"我们为什么要警惕电竞狂热—李曙光 “警惕电竞狂热”这个说法不无道理。 当前电竞行业的大方向是全盘向传统体育靠拢，代表性的举措包括建立青训梯队、引入大企业赞助商、设立战队主场等等。与之相对的则是去游戏化，将职业选手塑造成运动员而非游戏玩家。近年来电竞也逐渐获得了政府的承认，仗着庞大的群众基础，甚至能社会舆论上与传统体育分庭抗礼。 然而，上面的这一切，都是资本运作的结果。见到电子游戏搞比赛有利可图，游戏业内与业外的庞大资本蜂拥而至，硬是将小众的娱乐项目捧成了体育界的新星。而当资本的泡沫消散，仅靠玩家自发支持用爱发电，目前的盛况又能留存几何？ 还会有大量十六七岁的年轻人放弃学业自愿入行吗？还会有如此狂热的粉丝掏钱应援助威吗？还会有奔驰肯德基这样的大牌打广告吗？ 说得再直白一点，电竞还有资格跟传统体育相提并论吗？ “一代版本一代神”，电竞项目的规则完全被特定的商业机构垄断。姑且不论频繁平衡性调整的利弊，整个项目由单家公司运营的风险是极大的，稍有经营不当就会带来衰败甚至破产，然后全体从业者无一幸免。最近的例子是暴雪宣布风暴英雄职业联赛（HGC）停办，导致战队分部解散，选手被迫转行或退役。风暴还只是个冷门项目，DOTA或者LOL这样的超主流项目停摆后果简直难以想象。 至于“幸存者偏差”，成为职业运动员注定是一条一将功成万骨枯的道路，任何项目都是如此，甚至奥运冠军都难逃退役后落魄。把它作为电竞的独有缺点未免有些苛刻。以上结论的大前提还是“电竞属于竞技体育”，打游戏挣钱听上去下三滥，但是当运动员挣钱绝对很光荣！ 而“网络游戏带有原罪”这种话听个乐就行了，时代变迁中留下几具标本不是很正常？ 阅读原文","link":"/2019/11/14/%E7%94%B5%E7%AB%9E%E7%8B%82%E7%83%AD/"},{"title":"怎样看待陈凯歌的《白昼流星》？","text":"最致命的问题是逻辑混乱，价值观之类都是次要的。 神舟返航 和 老旗长带着两兄弟浪子回头 根本就没有建立起关系。 前半篇讲兄弟二人与老旗长相遇，偷钱，之后立即骑马去神舟，中间没有任何的过场，末了来一句“看到飞船落地，白昼流星找到了，大家都是回乡人。”请问这样的点题能说服观众么？ 既然致敬《悲惨世界》，那改邪归正的催化剂就应该是老旗长亲身践行的善怀，而不是凭空冒出来的神舟飞船。但从片头手书到标题无不在暗示本篇的主题就是载人航天，这就很尴尬。 航天和扶贫两个元素绝非没有交集，有修女致信nasa的典故，亦有《乡村教师》那样的巧妙构思，然而《白昼流星》却把它们生硬地拼凑在一起，得到了一个不伦不类的故事。 其他六个故事或多或少有些演绎夸张的成分，但骑马追赶军车、上前扶航天员的画面实在有点假得过分。 1注：《白昼流星》是电影《我和我的祖国》中的片段，在七部短片中争议最大。 更新：在nga看到一个《白昼流星》的影评，认为神舟返航象征着”化不可能为可能“ 最后的航天归来更是一种信仰或者说最后一根稻草上的击溃，如果本来说是不可能的事情都可以被党做到，那么脱贫又算个p呢？ 按照这种方式解读，航天与扶贫互不相关的逻辑bug就不存在了，甚至开头不知所云的父亲遗言也变得合理，整体立意能上升一截。 但这仍然无法掩盖叙事方面的无能，至少两位少年的表现很难让人相信他们发生了信仰层面的改变。 阅读原文","link":"/2019/10/06/%E7%99%BD%E6%98%BC%E6%B5%81%E6%98%9F/"},{"title":"机械重生：60%胜率低保任务骑","text":"失效——文章中的内容已经不再适用于当前情况，请谨慎参考 引言 在奥丹姆预览季，骑士任务制作木乃伊与它的前辈最后的水晶龙一样饱受诟病。新职业卡质量捉急，复生体系难堪大任，奖励每回合一个2/2也不够超模，甚至出现了“做任务等于给自己收尸”的说法。 然而新版本上线之后，骑士胜率位居第二，任务骑也在面对版本霸主防战时不落下风，证明了自己的价值。、 本人使用一套机械+复生体系的任务骑（与HDT版本略有不同），以60%胜率从9级打到5级。 如果要深入研究或者冲击高分段，建议查阅更多攻略。 核心思路​ 使用低费复生随从尽快做完任务，然后用技能复制机械蛋/机械雏龙，制造对手无法解决的场面取胜。 优势​ 1.通过技能无限增殖亡语/磁力buff，已经超出了绝大多数套牌的解场能力 ​ 2.完成任务后启动容易，一个机械蛋+技能就能滚起雪球。 ​ 3.前期小木乃伊有一定的站场能力，不至于空过挨打。 劣势​ 1.返场能力偏弱，难以应对快攻。 ​ 2.复生与机械彼此独立，意味着很容易鬼抽影响任务进度。 ​ 3.灯神找到了群体驱散。 组件分析：​ 首先要明确一点，任务骑的复生随从纯属做任务的工具人，并不依赖复制他们大后期，因此选择的标准是费用够灵活，最好还能被水晶学检索。 ​ 鱼人木乃伊和神殿狂战士无疑完美符合这一思路，夺烛木乃伊也凑合能用。由于奥术之尘不足，本人并没有尝试投入微型木乃伊，或许加攻的场面压力要比中立212复生大，但是机械种族多死几次可是会污染橙法复活池的。 ​ 对于4费以上的复生随从，白骨怨灵是最坚实的4费墙之一，卡塔图防御者则是集嘲讽亡语于一体的高value。相比之下先祖守护者只剩下吸血对快攻的威慑了，为了确保复生密度不太臃肿只能舍弃。 机械体系（8张）​ 一旦任务做完，就要考虑利用机械蛋和机械雏龙的高质量亡语终结比赛了。如果对手没能把05+22解干净，那就下回合再来一次，很快对手就顶不住了。吵吵模组和奇利亚斯则能提供圣盾嘲讽的磁力buff，逼迫对手解掉负嘲讽的亡语怪。对于一些解场能力薄弱的卡组，甚至可以在任务做完之前铺蛋+贴磁力，赚取一定的节奏。 ​ 这里要着重提一下中立万金油大铡蟹，出的11小机器人会卡格子并污染橙法复活池。请慎重考虑，不要无脑铺蟹站场，有时贴磁力解场更好。 ​ 坎格尔的无尽大军的用法相信玩过机械骑的人都懂。任务骑还能额外复制带磁力的大哥（不一定要亡语），提高被橙法拉起来的概率。或者复制橙法复活的圣盾嘲讽蛋，然后被130拉走。 稳定的过牌手段​ 任务骑对牌序的要求不是一般的高，先要尽快凑齐5复生做任务，然后要各种亡语磁力机械展开。稍有鬼抽就会导致任务做不完，或者不能及时压死对面。要在两种体系间无缝切换，关键在于流畅稳定的过牌。 ​ 水晶学的强度确实毋庸置疑，1费过两牌，任务进度+2，起手必留。然而光靠它是不够的。。考虑到卡组的曲线分配，最终选用女巫森林吹笛人，它在任务完成前能稳定检索低费复生，同时是一个可以站场的33随从；在任务完成后至少能滤一张牌，还有机会抽吵吵模组甚至蛋。冒险号角也是同理，附带的buff能稍微挽救一下低费杂毛的后期战斗力。 ​ 在构筑初期本人曾使用奋进的探险者与棱彩透镜。前者反而放大了牌序问题，做完任务再来就没用了。后者虽然比吹笛人多抽一张牌，但是抽的随从相对不可控，减费效应也没有机械骑那么突出。 其他​ 光铸祝福在打快攻的时候可以贴给嘲讽劝退，也能在中慢速对局里贴给亡语出的大哥拉血差。如果要追求更强的解场能力，可以考虑萎缩射线/生而平等。 对局分析：大优对局任务德 炸弹战 这些套牌前期放弃场面，解牌的数量，做完任务稳赢。 小优对局 任务萨 剽窃贼 控制法 防战 这些套牌有一定进攻性，但是一回合内给的压力有限，任务骑有了慢慢铺场的机会。 防战归入小优是因为解场和补充手牌都很突出，任务骑手牌跟不上的话很难稳吃。 小劣对局宇宙猎 超生德 奇迹法 这些套牌进攻性较强，能抢先制造我方无法解决的场面，抢先展开的一方胜算比较大。 劣势对局动物园 机械猎 奥秘猎 鱼人骑 套牌种类决定了任务骑比快攻容易卡手，赶紧溜下一把。 作为黑石山时代入坑的信仰骑，分享了一点微小的经验，希望营地老哥们能打出更好的成绩，谢谢。 1注：这篇文章只发在营地，并没有同步到知乎 阅读原文","link":"/2019/08/10/%E4%BB%BB%E5%8A%A1%E9%AA%91/"},{"title":"如何评价《英雄联盟》推出的「云顶之弈」？","text":"失效——文章中的内容已经不再适用于当前情况，请谨慎参考 目前来看不太乐观，未必能与v社的刀塔霸业竞争。 与追求和游廊自走棋相似来引流的手游厂商不同，拳头本来是最有动机在自走棋上做出创新的。然而从曝光的内容来看，英雄战棋依然照搬了大量游廊自走棋的东西，本应该有更多LOL的特色元素，却没有做出来。 羁绊抛弃了LOL宇宙的设定，套上各种生硬的名字；装备充斥着普攻x%几率触发的特效（明明自家有那么多打x环）；盖伦的E带上了魔免；最神奇的是“迷你英雄”，一种进不了召唤师峡谷，只能拿来下棋和喊666的信使。 对了，上述内容根本没有实装，6.18才进入测试服，然后再过几周才正式上线。而隔壁这周就要开始公测了！ 相比之下V社自走棋——刀塔霸业就处于一种更成熟的形态，在保留大部分原作棋子的同时，引入了被动天赋（别的游戏里叫perk），直接盘活了混乱不堪的装备系统。虽然ui尚且有点粗糙，但更新的也是非常勤快。 由此可见英雄战棋在测试进度与完成度上都落后于刀塔霸业，要想复制LOL对DOTA2的先发优势是不太可能了。 而在游戏本身以外的渠道方面，英雄战棋也没有想象中那么大的优势。 LOL客户端不到10G（Wegame选配），比20G的DOTA2客户端更简洁，然而国服特色——不能跨区匹配成了一个致命的问题，和朋友开黑下棋可能得开好几个小号，小号间的信使和皮肤不能共享，比起DOTA2一个steam账号走天下（还能一键切换完美和国际服）实在很不方便。 这两年LOL几乎没有卡蓝字的现象，但还是要忍受国服客户端莫名其妙的卡顿和bug。 而刀塔霸业甚至多多自走棋都有独立客户端，还是炉石传说那样的全平台互通，对于吸引非moba玩家而言这是一记降维打击。 很多人说腾讯的推广渠道无敌，qq微信加主播，分分钟再造一爆款。然而自走棋压根就没有王者荣耀/绝地求生那样的社交属性，卡牌+塔防也不见得能对上一般玩家的口味。DOTA玩家天生对LOL没有亲近感；“自走棋启动器”玩家的游廊地图更新的好好的，为啥要跑去下一个全新的客户端？想从上述群体里抢人是比较难的。 对于基数不小的LOL玩家而言，英雄战棋不是第一个特殊模式。既然设计师画了排位赛和移动端的饼，至少说明他们有把英雄战棋做成常驻模式的打算，而非像极限闪击那样昙花一现。LOL发展到今天，极地大乱斗培养出了一批死忠粉丝，无限乱斗号称开太久会损伤游戏寿命，证明玩家是很愿意走出召唤师峡谷的，未来出现棋宗也不足为奇。 一个很有意思的现象是，英雄战棋发布的消息，在国内论坛的热评是讽刺拳头抄袭，而在reddit上则是恭喜某个大主播（Scarra？就是英雄战棋最早的爆料人）的心愿成真。可见至少在北美，LOL和自走棋玩家的圈子重合度更高一些，还有主播和职业选手（比如doublelift）牵头，从游廊转入英雄战棋的比例也会大一些吧。 总结：从目前的信息看，英雄战棋作为LOL的特殊模式，在自家粉丝里有不错的潜力 。 作为独立的自走棋游戏 ，在排位赛和移动端实装之前很难与刀塔霸业竞争。如果未来游廊自走棋衰落，二者有机会 平起平坐。 阅读原文","link":"/2019/06/17/%E4%BA%91%E9%A1%B6/"},{"title":"童年回忆—弹钢笔","text":"你知道哪些匪夷所思的运动项目？ 小学时代最受欢迎的课间游戏，更通常的叫法是“斗笔”。 规则很简单，找张桌子，每个人摆支笔，轮流动手弹动/滑动自己的笔，把别人的打下去，场上幸存的最后一方胜利。 当然不会真的拿钢笔弹着玩，磕一下就废了，一般用几块钱一支的水笔。 07年左右的时候三国杀尚未问世，手机还没普及，10分钟又不够跑去操场。于是大半个班级都加入了弹钢笔的行列，下课铃一响就聚成一堆，两三分钟就能开一把。 当时我们甚至用桌椅在教室后面搭了一个3D的战场：有地形落差，有暗道，玩家每回合还能在几个平台之间来回移动，活生生地把弹笔玩成了任天堂明星大乱斗。 可惜没开发出计分表和联赛，否则玩的更过瘾。 最神奇的是，斗字辈的游戏还不止钢笔一家，衍生品多到了万物皆可斗的地步。 斗尺：一般用塑料直尺，玩法同斗笔（貌似这个更早），尺子还更耐打一点。 斗小车：风火轮/Tomica小车了解一下。一般有竞速和对撞两种玩法，后者不说了，前者要在教室门口的水沟里飙车，最狂热的时候甚至在教室后面搭了一圈赛道。当然小车已经算玩具了，自然有价格贵和容易被没收的问题。 斗笔套：取圆柱状笔套（一般买来保护木铅笔的削尖端）一枚，放在楼梯口，对其外沿施加一个切向力，然后笔套会转起来并沿着楼梯往下滚，这时就要比谁的滚的远了。笔套容易跑丢，于是某个楼梯被冠名“百慕大”。顺带一提，在桌肚里这么做笔套会像陀螺一样回转，十分有趣。 弹硬币：相对小众而考验技巧的分支，只能用手指弹而不能滑动。 以此类推，凡是能放在平面上，容易滑动的小玩意都能拿来斗。 《钢笔大战》：4399上的Flash小游戏，规则与我们玩的一模一样，作者还是个外国人，看来“斗宗强者”已经走向世界了。就算偏题了也想说一句，4399上有相当多的优质多人游戏，只需一台普通的电脑就能让好几个小朋友不亦乐乎。 在线玩《钢笔大战》： ​ 现在想想自己的童年还挺“不幸”的，既不能和小伙伴们在田野弄堂间穿梭探险，也不能随时掏出智能机来一把紧张刺激的5V5。即便如此，一群幼稚的孩童依然创造出了一系列朴素但好玩的游戏。回合制+动作，last stand之类的元素放到今天仍不过时。劳动人民的智慧果然是无穷的。 阅读原文","link":"/2019/05/14/%E6%96%97%E7%AC%94/"},{"title":"前朝遗珠：天雷滚滚打脸萨","text":"失效——文章中的内容已经不再适用于当前情况，请谨慎参考 本文首发于旅法师营地。 引言在炉石玩家的心中，猛犸年扩展包意味着超模，上至DK下至白卡三杰都是套牌里的中流砥柱。而刚刚过去的渡鸦年里，除了饱受诟病的狼王巴库（外加一个沙德沃克），几乎没有人能撼动环境。 那么，在辞旧迎新之际，标准模式还有没有能脱离猛犸年自力更生的套牌？ 还真的有这么一套： -为啥是预构筑，这是要用后朝的剑斩前朝的官？ -再仔细看看，除了淤泥吞食者，其他28张牌都在渡鸦年卡池里。换上火羽精灵，现在就能在标准玩上。 换言之，退环境对这套牌几乎没有影响。 明天过了1点，猎人的鼹鼠刺喉龙没了，牧师的复活钻石没了，小德的叠甲没了，骑士的强化技能没了，而萨尔依旧能化身“雷克萨”抄起锤子走脸。 强弱是相对变化的，原本默默无闻的打脸萨能否在剧变的环境中一鸣惊人？ 言归正传，让我们来详细地谈谈打脸萨。 核心思路：“前期小生物蹭血，然后爆发一波带走”是老生常谈的快攻套路。 这套打脸萨的随从占比不到50%，显然重心在法术和武器的直伤爆发上。 手感最接近的主流套牌是狗头人时代的奥秘法。 其实这个思路相当复古，2015年末的初代打脸萨（探险家协会）同样以直伤为主，连组件都没啥区别。 虽然现在没有坑道穴居人和图腾魔像这种低费霸主，但是过牌实在是流畅太多。 优势：1.爆发恐怖，空场打出十几点伤害非常容易。 2.稳定续航，青蛙之灵能源源不断补充法术。 3.由于不是特别依赖场面，对AOE有一定抗性。 劣势：1.随从比例低导致卡手概率上升，甚至有可能一直卡到3费。 2.和铺场型快攻争夺场面时难以占到优势。 3.大部分卡牌带过载，连续使用过载牌会严重影响节奏。 4.雷云元素招的火花没有冲锋。 组件分析引擎青蛙之灵：快攻卡组梦寐以求的过牌引擎，只要3费，还自带隐藏。只要预先调整卡组里法术的费用曲线，就是一个灵活版的加基森拍卖师。甚至有3费青蛙之灵+硬币+1费法术的操作。除非对手有海盗战/奇数贼级别的前期压制力，起手必须留下这张牌，有蛙和没蛙完全是两种节奏。 雷云元素：过载体系的“火妖”。打快攻能最大化过载牌的抢节奏能力，打慢速刷一地的火花也能提供可观的场攻。相比当前主流的偶数萨，打脸萨更能发挥出它的实力，整套牌里有高达12张过载牌可以触发它。 站场淤泥吞食者：火羽精灵的接班人，更容易被解还带过载，但是跟班的超模战吼抢节奏不容小觑。1费曲线对于快攻来说非常珍贵，是起手重点找的对象。 凶恶的雨云：合格的前期站场随从，22身材附赠一张元素。可能在润滑曲线上不如黑市摊贩与水文学家，但仍然可堪一用。 大地之力：巩固场面的低费buff牌，可供触发的元素除了222还有衍生物火花，和上面的雨云一样都比较朴实。 火舌图腾：削成3费以后已经有点跟不上节奏了，但是萨满还是需要这张牌来确立场面优势，和带突袭的火花联动可以以小换大。 无羁元素：带他纯粹是为了平衡套牌的随从占比（还有人记得KG马尔什系数吗？），如果觉得青蛙之灵运转不够流畅可以换成其他法术。 润滑静电震击：唯一可用的0费法术，瓶装闪电和突变都太差了。主要的作用是配合青蛙之灵抽1费法术，触发雷云元素，顺便补刀返场（可以打死奇利亚斯）。 大地震击/图腾猛击：打脸萨的石化风怒一波会被嘲讽挡住，因此带一张沉默过墙还是有必要的。如果环境里缺少嘲讽，可以打脸的图腾猛击会是更好的选择。 流电爆裂：当做迷失丛林用有点亏，一般在触发两张引擎卡时使用，或者补刀关键敌方随从。 舔舔魔杖：比预想的厉害，一张过载牌能加攻两回合，3攻打脸和补刀都很实用。考虑到和毁灭之锤互相卡的问题，只带了一张。 亡鬼幻象：低配版远古雕文，哪怕青蛙之灵在场也没法多次过牌（没有4费法术），但是多一个找直伤的梦想总归是好的。注意减费和发现并不绑定，发现低费法术后可以接一个0费熔岩爆裂。 元素反应：本身就不是稳定过牌，火羽精灵退了更没必要带了。 卡格瓦，青蛙之神：如果标准模式有熔岩震击这样解过载的牌，可以考虑引入蛙神回收直伤法术。目前的牌池还是算了。 爆发闪电箭、熔岩爆裂：地位类似法师的寒冰箭和火球术，费用还更低。尽管分回合打出的时候需要考虑过载的问题。 石化武器+毁灭之锤：同样是经典的爆发组合。5费准时提锤子能带来巨大的压力，随时都有可能打10/16斩杀。哪怕分开来做解牌/持续抢血也不算很亏。 伊莱克特拉·风潮：和直伤法术的配合显而易见，复制一个熔岩爆裂很赚，石化武器/闪电箭甚至大地之力也可以。相比之下泽蒂摩和快攻的相性就非常差。 火车王里诺艾：快攻标配，然而5费打6在直伤密集的打脸萨里显得有点笨重，可以考虑更换。 血法师萨尔诺斯：同样是可选的组件，能灵活地在战利品贮藏者和加法强斩杀之间切换。美中不足的是斩杀回合的费用往往会因为过载而很紧张，留给血法的空间不多。 对局分析水平和时间有限，实在写不出九职业详细对阵分析了 主要食粮1.前期羸弱的中慢速套牌。 （每个版本初期都有不少人玩这种巨贪卡组，然后中速猎又双叒崛起了） 2.某些缺乏回复手段的组合技套牌。 克星1.前期能迅速展开场面，抢节奏比较猛的套牌。 2.高额的治疗与吸血（以奇利亚斯为首）。 尽管打脸萨目前在天梯上极为罕见，稳定性也略有不足，但我还是推荐各位玩上几把，享受一下一通操作噼里啪啦斩杀的快感——也就是标题里的“天雷滚滚”。 而到了巨龙年新版本，这套渡鸦年原班人马又将如何证明自己，从无数预构筑中脱颖而出？ 别的不多说，提前祝各位新年快乐⑧。 Frohes neues Jahr! 阅读原文","link":"/2019/04/09/%E6%89%93%E8%84%B8%E8%90%A8/"},{"title":"棋战八方——六战士体系简明指南","text":"失效——文章中的内容已经不再适用于当前情况，请谨慎参考 本文首发于旅法师营地，已获得编辑推荐。 引言六战士流（娜迦野兽）是当前自走棋的强势套路之一，能稳定地发挥。 本文旨在为萌新提供入门教学。如果要深入研究，建议查阅更多攻略与视频。 核心思路6战士(15甲)+2野兽（10%攻击）+2娜迦（30魔抗），最低7人口即可达到完全体。 优势1.场面扎实，buff能覆盖到全队，对物理法术均有抗性。2.对三星要求不高，全员二星也有相当强的战斗力。3.可用组件范围广，能稳定过渡到凑齐6战士，不必苦等key牌。 劣势1.前期不能快速升星容易掉血，哪怕有3战士buff在手。2.缺少爆发与先手，非常依赖持续输出。3.如果不能尽快结束比赛，可能打不过龙骑/六地精之类的真后期套路。 本家单卡分析1块钱巨牙海民：野兽种族，关键的buff来源，大招在前期也输出不俗。可以一直用到完全成型。斧王：身板优于海民，费用低能速二星，前期中坚力量。由于大招偏防守，没有三星的话往往会在后期被其他两星战士换掉。小小：攻速低，元素属性基本没用，大招也不契合战士的肉搏打团。唯一不考虑拿的战士，除非前期拿一个强行凑三战士。 2块钱剑圣：低费战神，大招提供了关键的aoe伤害。能拿就拿，多多益善。鱼人守卫：乍一看很平庸，但是是战士中唯一带有娜迦种族的，大招破核有奇效。前期拿来平滑过渡，低费升星不难，后期外挂美杜莎/潮汐能加魔抗。 3块钱狼人：唯二的野兽战士，大招变身带召唤物能给防守方带来巨大的压力。但是一星的时候回蓝速度np率捉急，容易在变身前暴毙，变身的前摇还特长。狼人的主要意义还是野兽，关于投入野兽的问题会在之后说明。 4块钱末日使者：身板非常优秀，恶魔自带真伤，大招直接废掉对面一人，中后期关键组件。海军上将：身板略弱于末日，但大招能提供额外的爆发与控制，打团作用更大。人类属性和狼人有迷之combo。巨魔战将：纯粹的远程dps，考虑到他和物理装备（特别是疯狂面具）相性很好，个人认为还是能加入六战士体系的。人口紧张时，上场优先级末日&gt;船长&gt;巨魔。 外挂/过渡单卡分析食人魔魔法师：一费顶级战力，二星蓝胖能当前排吸收大量的伤害，大招给队友加攻速等于变相加速回蓝。敌法师：同样是低费速二星选手，功能性足，在剑圣狼人起来之前可充当dps。兽王：战斗力堪比剑圣，可惜不是战士。前期可以多抓几个补伤害，但是升级最好还是本家战士优先。注意和斧王/剑圣同场能加血。蛇发女妖：娜迦战士流崛起的原因之一，后期最强挂件。大招能提供巨量的增伤与控制，两星之后一个大招能决定团战胜负。干扰者：虽然能凑4兽人，但目前来说是美杜莎的下位替代，萨满属性等于白板。潮汐猎人：娜迦中的大哥，团控无敌但容易暴毙，一般一星美杜莎&lt;=一星潮汐&lt;二星美杜莎。德鲁伊家族：个人非常钟爱的外挂体系，能大大加速核心思路的成型。首先德鲁伊中有两个野兽。小鹿虽然战斗力弱鸡，但至少能在前期凑buff给所有人加攻。而利爪德鲁伊则是四费最强前排之一，召唤物比本体更能打。恰好六战士非常依赖野兽buff。这时德鲁伊升级快的优势就来了，两张小鹿/熊德+任意德鲁伊就能二星，四德全在手甚至能速三星。哪怕与战士完全无关的大树和先知，升到三星也能提供充分的坦度/召唤物。关于野兽优先级的问题，可用的野兽共有海民狼人熊德三张，海民由于上手率的关系基本能坐稳首发。在不严格凑六人羁绊的情况下，一般二星熊德&gt;二星狼人&gt;一星熊德&gt;一星狼人，尽可能做到最大化战斗力。后期达到8-9人口时，具有星级优势的德鲁伊也能当个优质的挂件。 升级顺序前面说过六战士的套路没必要特别追求三星，全员两星就能到达强势期。因此在搜卡时优先满足核心组件，狼人/船长/美杜莎等高费卡两星就足矣。对于海民剑圣等低费卡，费用充裕的话可以存起来，这些卡冲击三星的几率更大。 实战复盘 分享了一点微小的经验，希望各位棋友们能打出更好的成绩，谢谢。 阅读原文","link":"/2019/03/08/%E6%A3%8B%E6%88%98%E5%85%AB%E6%96%B9/"},{"title":"《四驱兄弟》中弄拙成巧的误译（外一则）","text":"有哪些最终被大众认可、并成为主流的错误翻译？ 《四驱兄弟》WGP篇 意大利队 作为当年引进的诸多中配日本动画之一，四驱兄弟是许多人的童年回忆。“旋风冲锋龙卷风”之类的翻译也深入人心。 到了第二部，来自世界各地的车手纷纷登场，对于译配人员而言是不小的挑战，偶有失误也在所难免。 比如唯一反派意大利队： 百度百科/日配字幕给出的队名是纯音译 当年中配版里意大利队却叫“天马队” Rosso Strada原意是“红色的道路” 显然“天马队”比“红路队”或者“罗索史特拉达队”更加通顺且易于辨识，尽管它是根据队标另起炉灶。鉴于《四驱兄弟》的受众以低龄儿童为主，个人认为比起一般的望文生义，更像是折中的本地化方案。 而赛车名Diospada同样很生僻。我一度以为“神剑号”也是看图说话的产物，直到用百度翻译查了一下： 可见译配水平相当出色，“神剑号”完美符合原意，比“迪欧斯巴达”（漫画台译）不知道高到哪里去了。 p.s. 虽然是日本动画，但四驱兄弟篇大量的人名，赛车名，招式，以及赛事相关的专有名词都是外来语。如今B站的日配资源直接用原语言字幕标注，当年的中译已成绝响 阅读原文 说到本地化（翻译），又想起了回答过的另一个问题（2019-11-13） 你见过哪些绝妙的翻译？ 《精灵宝可梦 剑/盾》的传说宝可梦 这只宝可梦英文名叫Eternatus，也就是舅舅党频繁提及的“邪恶第三神”。按照传说宝可梦名字音译的惯例，应该叫做“伊特拿图斯” 1`注：直到剑盾正式发售，所有的泄露消息都只用Eternatus指代第三神，而且前七世代的一级神英文名全部由日文音译而成 然而解包出的官方中文名让我大吃一惊： 无极汰那 “无极”对应Eternal，也就是“永恒”的文艺说法。而“汰那”纯属生造词组，也无法与Eternatus的读音对应，看上去很让人迷惑。 但仔细想想剑盾的招牌机制，答案就呼之欲出了： 汰那～Dyna～Dynamax～极巨化 没错，汰那实际上是“极巨化”的谐音，连在一起就是“永恒的极巨化”，这与剧情爆料中邪神的能力是一致的！ （无极汰那是伽勒尔极巨化能量的源头，还有一个种族破千的终极形态） 至于“汰”是否指第三神被召唤出来要毁灭世界，需要等游戏正式发售后进一步解读。 我们一般认为优秀的翻译要满足“信、达、雅”，而“无极汰那”甚至要更胜一筹，结合作品背景融入了比原文更丰富的内涵。 在游戏本地化领域，这样的译名是足以载入史册的，与“锤石”“千珏”一样成为玩家口口相传的经典。 上面的回答写完不到24小时，就有人提醒我这是按照日文名翻译的。 果不其然ムゲンダイナ=Mugen（无限）+Dyna（极巨化），反而Eternatus是意译。 上面吹的太过被打脸了，不过选取的汉字还是可圈可点的。 阅读原文","link":"/2018/08/13/%E5%9B%9B%E9%A9%B1%E5%85%84%E5%BC%9F/"},{"title":"如何看待&quot;精日”行为或将面临刑事处罚？","text":"所谓“精神日本人”，大致分为文化性与民族性两类。前者无脑吹捧日本的文化、社会制度与民族精神。后者以日本人/大和民族自居，从根源上仇恨中国与中国人。 鉴于改开早期全民崇拜西方的社会土壤已不存在，当代未成年人成为文化性精日基本上是因为价值观不成熟+沉迷日本文化相关的事物（动漫、小说等），从而“爱屋及乌”走到精日的歪路上。这与崇拜欧美/纳粹的理由基本一致，比起“皈依者狂热”更像是“中二病”。 这类精日危害大么？显然，单单是吹捧日漫就能令大多数人感到恶心。但未成年人三观尚未定型，随着精神不断成熟尚有可能摆脱错误的精日观念。社会上许多40～50岁的老精日从中日差距极大的80年代一直跪到现在，思想已经无可救药，只能抱着对日本和西方的崇拜进坟墓。相比之下，日漫痴病的还不算重，甚至有成为友军的潜质。 至于不承认自己是中国人的民族性精日，未成年人很少能走到这么极端的地步。然而年初穿日本军服拍照的事件中参与者多为不到20岁的在校学生。这种现象只能归结于思维偏激（可能是生活失意、受重大变故刺激、或者说家庭教育问题）+社会人士教唆（民族性精日的组织者基本上是社会上的成年人，甚至有拿外务省钱的）。 总而言之，民族性精日往往组织严密，领头的真汉奸引诱有着极端倾向的边缘人入伙，跟进洗脑教唆，然后抱团搞出各种大新闻。原理其实和毒贩拉人下水差不多。 回到问题本身： 此处特指美化侵略战争、侮辱抗日英烈的行为 显然对于这条草案“范围模糊，容易滥用”的质疑是不成立的，因为歪曲历史侮辱英烈的行为一旦发生几乎没有辩驳的余地。 文化性精日包含的范围太广，从稍稍表示对日本的向往到叫嚣中华民族永远追不上日本都可归入此列，因此不适合专门立法予以打击（否则就成了所谓的口袋罪）。 英烈保护法草案显然针对的是后者。鉴于民族性精日立场之极端（专门在抗日战争、南京大屠杀一类的敏感事件上做文章），手段之恶劣（亵渎英雄，威胁爱国网友），我并不对被忽悠成网络恐怖分子的精日报以同情。这些人值得用《刑法》予以剿灭。 1注：这篇文章实际上由两篇知乎回答整合而成，故分别列出原文。 原文一 原文二","link":"/2018/07/04/japs/"},{"title":"金工实习有哪些可以做到的小玩意?","text":"大一下参加的金工实习，由于是机械专业，实习期非常长（每周四全天+半个暑假），期间也有不少小作品。 小手锤—钳工+车工这个是金工实习标配，锤头特意做过热处理，可以像市售的工具一样敲打。 齿轮组—3D打印建模建了好久，可惜转不起来 提里奥·弗丁—激光雕刻这个就比较酷炫了，先是在一个类似画图的软件里描出图案，然后用数控机床切割。 画风比较抽象。 AE86(?)—线切割数控机床实习中线切割的编程、输入工序是最繁琐的，老师也比较严格。 不过整个流程还是很顺利的。最后打分的时候还要谈谈设计理念。当时在补《头文字D》，于是就照着86的样子画了个小汽车。 阅读原文","link":"/2018/07/03/%E9%87%91%E5%B7%A5%E5%AE%9E%E4%B9%A0/"},{"title":"神奇的咖啡机bug","text":"有哪些让你目瞪口呆的 Bug ？ 在同济嘉定图书馆底楼，有一台“咖啡码头”，靠扫二维码购买饮料。一次扫码显示我有一杯6月底（上学期期末在四平校区图书馆）下单的香柚红茶（4元）尚未冲泡，于是我点了确定。 ↓事后的截图，在冬季香柚红茶已经下架了，正常情况下买不到。 However泡完了发现出来的是抹茶红豆拿铁（10元） 更神奇的是这杯抹茶是加冰的，而正常情况下抹茶只能选热饮。 总而言之，这个bug让我节约了6元，顺便弄出来一杯“专属版”饮料，算是紧张期末季里的小逸事了。 PS： 推测bug的原理是两个季节限定饮料（香柚与抹茶）共用一个内部代码，但饮料的做法（冷热）在下单时就决定好了。 由于咖啡机默认下单付款后立即冲泡，因此很难刻意实现这个bug。6月份的购买记录能留到年底，是另一个“付款不出货”的bug导致的（我记得当时立即再买了一杯，反正很便宜）。 说到付款不出货，嘉定这边的售货机大多用二维码付款，但是老式的机器还是会出问题。17年的时候我在北楼底楼的自动售货机那里被吞过硬币。解决办法是打报修电话，然后到南楼的某个办公室（好像是管失物招领的）登记，真的可以把钱拿回来！ 1注：知乎上显示答案编辑于2019年1月，但这件事显然发生在大二上期末（2018年1月），具体日期已经无法考证。 阅读原文","link":"/2018/01/10/%E5%92%96%E5%95%A1%E6%9C%BAbug/"},{"title":"如何评价Doki Doki Literature Club？","text":"同意@五犬关于Alternative Reality Game的说法，与其说ddlc是个卖噱头的metagame，不如说它是个大型预告片。 游戏文件解密的很大一部分内容都独立于文学社的主线之外，首当其冲的是这份诡异的实验报告http://www.projectlibitina.com/一下跳戏到生化类恐怖游戏。 对隐藏诗歌，monika.chr等解密，“第三眼”“逃离”等关键词多次出现，还有一些奇怪的人名。这些跟游戏的主线剧情格格不入。微博上有人认为这是ddlc本身世界观的补充，但是游戏本身明确表示故事发生在虚拟世界（电子游戏），很难带入上述的超自然现象。 那么这么多隐藏内容岂不是很浪费？ 我认为，这些元素可能是在预示制作组Team Salvato的下一部作品！ 新作品可能是一部恐怖解谜游戏，与ddlc共享部分世界观。project libitina、逃离实验室、第三眼都是推动剧情的关键。（甚至我怀疑游戏名就叫Portrait of Makrov，yuri的那本小说） 如果制作组真的发布了“续作”，那么ddlc就不仅仅是一个靠metagame元素取巧的小品，而是精心铺垫的序章。这样的脑洞也是相当惊人了。 （btw，游戏本体免费，是不是有吸引更多人参与解密的意思在里面？） （Steam上免费游戏相当稀少，对于完成度极高的DDLC而言，这是个很反常的现象） 12.17补充： 续作铺垫理论最早出现于reddit，各种国内外网站都有人做过解密与推测。 Doki Doki Literature Club!! http://tcrf.net是一个游戏拆包资料站，在DDLC上并没有搞出什么花样 但是拆包出的早期cg只有三个女主，唯独缺了yuri 这是否能说明yuri的设计完成得更早？ 【游戏理论家 中字】潜藏在《心跳文学部》之下的，最可怕的秘密。 【游戏理论家 中字】《心跳文学部》！解密！ 1注：由于B站一度封杀DDLC，上面的视频链接已经失效 制作非常精良的解密视频，其看法如下： 1.续作可能是恐怖游戏，剧情与yuri的那本小说密切相关。 2.四个女主可能是另一个游戏穿越过来的，这解释了“打破次元壁”的现象。 3.monika.chr的隐藏文字是monika在警告主角。 （按照视频里的解读，我反而倾向于这是反复读档“穿越”收集全cg打出真结局的暗示） 4.Libitina就是yuri本人！ （这个解释过于牵强，yuri的病娇性格已经明确说明是monika用管理员权限植入的；年龄没有给出明确的设定，只是看起来很成熟；官方商店的海报倒是很有暗示性，但还不足以说明Libitina和yuri是同一人） 在上面视频的末尾，有自称与作者联系过的汉化组成员表示 续作 可能 并不存在 ，并且游戏可能还有更多（无法被翻译的）隐藏要素。 12.19继续补充： 去reddit上面转了一圈，发现作者本人 竟然开了答疑帖 Hello, my name is Dan Salvato. I created Doki Doki Literature Club. AMA • r/DDLC 感兴趣的话可以慢慢翻，作者谈了很多感想。 然后找到了这个，Dan表示要做一个“正常”一点的Visual Novel （但是并没有提到具体的发布日期） In case anyone missed it, Dan confirmed he’s making another VN • r/DDLC阅读原文 阅读原文","link":"/2017/12/19/ddlc/"},{"title":"军训小结","text":"​ 今天是9月11日，2017年同济大学军政训练即将步入尾声。过去的半个月里，我们在严格的纪律与辛苦的训练中接受着磨炼。在炎炎烈日下挥洒汗水，在滂沱大雨中坚持训练，我们一直在与困难斗争，却从未退缩，甚至乐在其中。用教官的话说，就是“痛，并快乐着”。 ​ 军训，顾名思义，就是以军人的标准受训。而军训给我最直观的印象，就是极强的纪律性。在军队里，服从命令是天职，令行禁止是最基本的要求。教官喊一声“向右看齐”，就要迅速调整姿态，排成整齐的队伍；在队列里，要时刻保持昂首挺胸的站姿，连擦汗这样的小动作都要打报告；齐步走行进队伍务必整齐，不能散落。最关键的是，一人违反纪律，全队都可能受罚。个人的自由所剩无几，高强度的训练使人劳累。作为一名学生，我们可能会觉得这一点都不人性化，与散漫的大学生活格格不入，从而感到痛苦甚至绝望。常人当然可以我行我素，对组织纪律置若罔闻，但军人不可以。在战场上，军心涣散等同于战败。只有严明的纪律，才能将一盘散沙凝结成磐石般坚韧的队伍，才能形成战斗力。这也是那些看似枯燥无用的训练项目——站军姿，齐步走，甚至是叠豆腐块——存在的意义。纪律是军队的基石，想到这里，我不再会抵触那些苛刻的命令，开始向军人一样接受它。 ​ 就在昨天，我们排因为队伍太散漫被教官罚蹲五分钟。看似简单的蹲姿，持续了不到一分钟大腿就疼痛难忍。当我们在忍受这场折磨时，教官在解释这次惩罚的缘由。他说训练就要一令一动，而我们接到整队命令时有一半人在嘻嘻哈哈，根本没法训练。他还提到军队里这样的蹲姿起码要持续三十分钟，懈怠的话会挨打，远比军训严厉。而在我们受罚的同时，另一个教官也在陪我们蹲，他丝毫没有叫苦。这次经历让我对军人的敬意更增一分，同时也对军队的纪律性有了更深的认识。 ​ 军训给我的另一印象是激昂的气魄与强烈的集体荣誉感。拉歌是军训的传统项目，训练场上常常传来嘹亮的军歌。然而拉歌比拼的只是唱歌而已吗？按照教官的说法，唱军歌不要求着调，只要声音够响就可以。在我们齐步走行进时，也常常被要求喊“一二三四”的呼号。如果不够响，就会被认为是训练不积极。这种众人高喊口号的场景在社会上可能会使人尴尬，而在军队里是振奋士气的重要手段。即使是由稚嫩的大学生组成的队伍，喊着整齐划一的呼号，也能迸发出昂扬的斗志与阳刚的精气神。 无论是拉歌还是呼号，高声呼喊的用意之一是压过别的队伍。在军训时，大家都很珍惜自己队伍的荣誉，力争赶超他人——无论是队列还是唱歌。如果表现欠佳，从教官到学生都会感到丢脸。甚至出现了两个排的男生比拼做俯卧撑的场面。军训如此，军队亦如此，每个军人都以自己所在的部队为荣。对越自卫反击战时，解放军战士们争先恐后地要求上前线参战。在《建军大业》中，也有革命军争誓死留守三河坝断后的场景。战时舍生忘死的爱国主义精神，是一种升华到极致的集体荣誉感。而在和平年代，军中涌现的模范标兵更是数不胜数。对荣誉的渴望激励着古往今来的军人保家卫国、建功立业，也铸就了军人对国家与人民的奉献精神。 生活中，我们常常会遇到个人利益与集体利益冲突的情况，往往会为自己的利益申辩，顺便把“集体荣誉感”这个概念批判一番。而在军队里，个人必须服从于集体，集体的荣誉更不容玷污。平日自私任性的坏毛病，到了军训时就要吃点苦头才能改过来，绝不会被惯着。许多人抱怨军训消解学生的个性，禁锢学生的思想。稍作思考就能看出这是无稽之谈。军队崇尚集体主义，从来就不是发挥个性的地方。 对我而言，军训不仅是对身体的磨炼，更是对意志的试炼，是对军营生活的深刻体验。军训结束之后，我或许会忘记军体拳的打法，或许会疏于锻炼身体，或许会回归懒懒散散的状态。但从这次军训中领悟到的军队作风及军人精神，将在心中留下不可磨灭的烙印。 ———————————— 这篇文章本来是学校布置的总结，纯粹是形式主义产物。当然我还是设法把自己对军训乃至军队精神的想法写了进去，博人一观而已。 阅读原文","link":"/2017/09/11/%E5%86%9B%E8%AE%AD%E5%B0%8F%E7%BB%93/"},{"title":"抛砖引玉：冰封王座的鱼人萨","text":"失效——文章中的内容已经不再适用于当前情况，请谨慎参考 摘要：浅谈标准萨满鱼人体系在各个版本的补强以及铺场萨结合鱼人体系构筑的可行性 ​ 声明：本文属于“浅谈”性质，只是谈一谈自己对铺场萨与鱼人体系的认识。贴出的套牌并没有足够的战绩支持，请谨慎使用！​ 本文只讨论标准模式下的套牌。 套牌简介​ 安戈洛后期，带有异变和魅影歹徒的铺场萨是兼具强度与娱乐性的中速套牌，也是当时我最常玩的套牌之一。到了冰封王座，铺场萨依然对t0德鲁伊保持一定优势。随着版本不断演化，我放弃了异变体系，带上了555铸剑龙+骨魇的buff套。这一体系与萨满的一地杂毛相性良好。 ​ buff萨是铺场萨在这个版本的第一次演变，那么铺场萨是否还有发展空间？在借助鱼人的力量撸死巫妖王之后，我构思了这套鱼人萨，在4~5级间打了十几场，效果比预料的“娱乐套牌”要强。 冰封王座对萨满的鱼人体系有何加强？​ 首先是222冰冻鱼人，这是一个宝贵的二费鱼人(构筑中同类只有223buff鱼人，蓝腮战士显然不适合铺场体系)，其战吼能在后手冻住一个随从强行站场，或是冻住贼德的脸防止己方随从被补刀，可以说很符合铺场萨站场抢节奏的奥义。尽管比起水文学家或是121冰元素，冰冻鱼人并不出色，但它在鱼人萨里还是物尽其用了。​ 其二是冰钓术，2费过两张鱼人。这张牌的地位堪比鱼人骑的神恩术，弥补了萨满过牌不足的弱点。自从蓝龙退环境，萨满就只能靠303马桶过牌，而马桶只能在场面优势时发挥作用。现在选择鱼人体系，也意味着有了更高效的过牌。(btw，当初玩机械法的时候我都是满编奥术智慧的，现在来了个豪华版)。​ 其三是骨魇，全民中立buff。相比德牧贼，萨满有着更优秀的铺场能力，骨魇利用率更高(和圣骑比么…至少我们有嗜血)。这张牌能将场面优势无限扩大变成胜势，算是终结手段之一。 安戈洛对萨满的鱼人体系有何意义？​ 223buff鱼和454巨壳龙奠定了铺场鱼人体系的基础。前者buff低费鱼人迅速滚起雪球，后者提供了直接的爆发。天胡情况下123下鱼人，4费进化出圣盾/加血，5费嗜血带走(极端情况下甚至4费进化就能击杀对手)。就算牌序不灵，也能在在芬杰拉人的一回合进化，制造难以解决的场面。相比传统铺场萨，鱼人萨爆发点一下提前了不少，手段也更多样(安戈洛异变萨也能5费爆死对手，但前期杂毛站住的难度比鱼人大多了，就算站住了也容易出现一堆0攻1攻小人干等嗜血的情况)。​ 铺场萨的另一张常客：203蛮鱼图腾也是一张鱼人体系的牌，尽管安戈洛时代它只是单纯地招个11撑场面。现在这张牌能和鱼人招潮者，领军甚至是巨壳龙配合了。​ 安戈洛的另一张鱼人体系牌是昙花一现的萨满任务。尽管我的卡组走的是中速路线，与当初无脑打脸的任务萨相距甚远，但我认为它未必不可用。这套鱼人萨只有3张1费，其中鱼人只有两个招潮者，这意味着先手起手没有1费就要空过一回合，对牌序依赖性大大提升。相比之下鱼人骑有6～8张1费(111圣盾嘲讽，113紫卡，121污手党，招潮者)。传统的铺场萨外挂帕奇斯体系，1费压力不大。因此，缺乏1费是鱼人萨的弱点，严重削弱了稳定性。那么，一张稳定起手的任务是否能弥补这一点？此空过非彼空过。 加基森对萨满的鱼人体系有何意义？​ 青玉爪，青玉闪电，爱雅黑掌：中速萨的基石，抢节奏直伤铺场一气呵成，泛用性太强。​ 芬杰：芬杰一般有两种用法。在死鱼体系(死鱼骑/海鲜贼，卡组里只带领军蓝鳃)里芬杰能稳定拉出若干个领军/蓝鳃，相当于一波小王者归来，追求高质量返场；在活鱼体系(中速骑/鱼人萨，卡组里一票鱼人)里，芬杰的下限低了不少，可能只能拉出两个小朋友。这个时候就要从手牌打出巨壳龙/领军/骨魇buff一波了，毕竟芬杰拉人不要费用。尽管死鱼体系在加基森后渐渐淡出标准，芬杰依然是鱼人卡组中期快速铺场的核心。 更早的版本对萨满的鱼人体系有何意义？​ 古神和卡拉赞以前并没有专门加强鱼人萨的牌，还是谈谈铺场萨组件吧。​ 大漩涡传送门是卡拉赞时代最后的遗产。作为一张低费的aoe，大漩涡一直是铺场萨的常客，也是为数不多的纯解场牌。在鱼人萨中，随从的血量比起传统铺场萨更为宝贵，大漩涡可以一键补刀，减少用随从吃随从带来的损耗，顺便招个1费小人。​ 比起德鲁伊和圣骑士，萨满没有那么多花式buff随从的手段。萨满独有的优势在于火舌图腾与嗜血。前者能在前期以小换大稳住场面，后者是铺场萨最关键的斩杀手段。同样是鱼人套，圣骑士有更超模的生物（113鱼人，水文学家，佛丁）与优质buff（守日者，剑龙骑术），而萨满的优势则在于返场与爆发。​ 不知不觉写了那么多，从单卡抉择到卡组的优缺点都讲了一遍。新版本开了将近一个月，“德鲁伊英雄传”“接近末期”的悲观说法不绝于耳。但如本人所言，这个版本还有开发空间，哪怕是多一种抗德手段也好。In a word，希望鱼人萨在这个版本能发展出成熟构筑，成为新一代“地表最强萨”！ ———————— 2017.9.2 后记​ 本文原定于旅法师营地投稿，然而不幸被退稿。同期营地刊登了另一篇传说鱼人萨的文章，卡组如下： ​ 从这个卡组中我们可以看出上文关于1费曲线的论断基本正确。营地鱼人萨牺牲了一部分卡位带上了更多1费，去掉了冰鱼人与爱雅等缓牌，整体节奏更快（尽管放弃冰钓术这种高效过牌值得商榷）。现在的卡组普遍趋向于极端的快速/慢速，营地鱼人萨可能比本文的鱼人萨更适合高端局的环境。 阅读原文","link":"/2017/08/30/%E9%B1%BC%E4%BA%BA%E8%90%A8/"},{"title":"在上海市实验学校（SES）就读是什么样的体验?","text":"初次接触实验应该是初中时参加集团校英语竞赛，当时就被实验的校园震惊到了。一年之后，幸运地被实验提前录取，然后进了理科班（5班），最终进入上海的一所985大学继续深造。 1注：这里的“集团校英语竞赛”选了校内前两名代表实验西校参加总决赛，我是第三名，以评委身份受邀参观实验。 OK，以上是我在实验的大致经历，下面再来谈谈实验对我人生的影响。 首先，实验为我提供了展翅高飞的平台。换言之，实验激活了我的上进心。实验的高中有通过期中/期末成绩升入理科班的机制，这使得我从高一就开始有的放矢认真学习，有一个良好的开头。 到了5班以后，班上学神云集，我开始学习他们的经验（刷题，早锻炼）等等，偶尔与他们一较高下。进入高三以后，我又找到了新的目标：考上上海最优秀的大学（即便高一时我对大学基本没啥概念）。在进入实验以前，我从未如此迫切地想向上攀登。说到攀登，这个词是实验的校训，也形象地描绘了实验积极的学风与校风。 当然，实验的人也很值得怀念。毕业之后怀念老同学是人之常情，怀念不熟的人纯属跟风，怀念关系密切的好友才是真情怀。尽管我一点也不擅长和人打交道，但还是在三年里结识了许多意趣相投的朋友，毕业了以后还经常出去旅游。无论是同学还是老师，总有人与我相处的非常愉快。限于篇幅，他们的故事就不再赘述，有空慢慢更。反正没什么人会看到这条回答。 1注：与高中同学一起出去旅游的照片就不专门放了，以后有空专门写篇文章盘点。 如果还有什么要说的，就谈谈住宿的体验吧。实验在浦东，我家在遥远的闵行（那边正好开了一家实验集团的分舵），所以理所当然地住进了学校，一住就是三年（学校原则上不支持高三住宿，一般选择在周边租房子，但我选择留下来，每晚10点睡觉从不修仙）。 实验的住宿生活简直一颗赛艇。宿舍两人一间，自带电梯空调热水，男女在同一幢楼，简直完爆大学宿舍。早晚餐的花样也挺多（比午餐强），晚上能在图书馆晚自习（听说图书馆又大修了），偶尔还能订个外卖。住宿意味着要远离父母，自己安排起居学习。许多人要到大学才能融入这样的生活，而我在高中已经体验过了，应付起来自然轻松。 我在实验只待了短短三年，特需课之类的特色项目也没怎么完整体验。作为一个实验的轻度用户，完全没法和这个问题下的众多大佬相提并论。However，我依然是母校的坚定粉丝。实验是我当年所能考上的最好的高中，也是我梦想起飞的地方。 1注：在本站收录的知乎回答中，这是创建时间最早的一篇，可以说是处子答了。 阅读原文","link":"/2017/08/28/ses/"}],"tags":[{"name":"生活","slug":"生活","link":"/tags/%E7%94%9F%E6%B4%BB/"},{"name":"ACG杂谈","slug":"ACG杂谈","link":"/tags/ACG%E6%9D%82%E8%B0%88/"},{"name":"时政","slug":"时政","link":"/tags/%E6%97%B6%E6%94%BF/"},{"name":"公告","slug":"公告","link":"/tags/%E5%85%AC%E5%91%8A/"},{"name":"炉石传说","slug":"炉石传说","link":"/tags/%E7%82%89%E7%9F%B3%E4%BC%A0%E8%AF%B4/"},{"name":"失效","slug":"失效","link":"/tags/%E5%A4%B1%E6%95%88/"},{"name":"文艺复兴","slug":"文艺复兴","link":"/tags/%E6%96%87%E8%89%BA%E5%A4%8D%E5%85%B4/"},{"name":"技术","slug":"技术","link":"/tags/%E6%8A%80%E6%9C%AF/"},{"name":"404","slug":"404","link":"/tags/404/"},{"name":"扩展","slug":"扩展","link":"/tags/%E6%89%A9%E5%B1%95/"},{"name":"宝可梦","slug":"宝可梦","link":"/tags/%E5%AE%9D%E5%8F%AF%E6%A2%A6/"}],"categories":[{"name":"原创文章","slug":"原创文章","link":"/categories/%E5%8E%9F%E5%88%9B%E6%96%87%E7%AB%A0/"},{"name":"知乎回答","slug":"知乎回答","link":"/categories/%E7%9F%A5%E4%B9%8E%E5%9B%9E%E7%AD%94/"},{"name":"公告","slug":"公告","link":"/categories/%E5%85%AC%E5%91%8A/"},{"name":"原创视频","slug":"原创视频","link":"/categories/%E5%8E%9F%E5%88%9B%E8%A7%86%E9%A2%91/"},{"name":"知乎文章","slug":"知乎文章","link":"/categories/%E7%9F%A5%E4%B9%8E%E6%96%87%E7%AB%A0/"},{"name":"其他投稿","slug":"其他投稿","link":"/categories/%E5%85%B6%E4%BB%96%E6%8A%95%E7%A8%BF/"}]}